-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  Z:\Temp\Aim2_GitHub\Individual-level analyses\Output\session.smcl
  log type:  smcl
 opened on:  30 Nov 2021, 16:36:09

. set more off

. 
. use "P:\Dementia_IK\FORTE_postdoc\Aim_2\Data\Derived_data\BMI_dem_mediation_2
> 0210707_late.dta", clear

. rename *, lower

. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    // DATA MANAGEMENT //
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. /// NOTE! Removing any non-essential code, as everything is set up as in main
>  analyses
> 
. // Setting BMI below 15 or above 55 as missing
. replace bmi=. if bmi < 15
(2 real changes made, 2 to missing)

. replace bmi=. if bmi > 55
(0 real changes made)

. replace whr=. if whr > 1.35
(1 real change made, 1 to missing)

. drop if bmi==. & whr==.
(1 observation deleted)

. 
. // drop those with no mediator measures
. drop if crp==. & tc==. & hdl==. & ldl==. & tg==.
(198 observations deleted)

. 
. gen tc_dup=tc
(4 missing values generated)

. replace tc=. if tg>tc_dup & tg!=.
(22 real changes made, 22 to missing)

. replace hdl=. if tg>tc_dup & tg!=.
(20 real changes made, 20 to missing)

. replace ldl=. if tg>tc_dup & tg!=.
(4 real changes made, 4 to missing)

. replace tg=. if tg>tc_dup & tg!=.
(22 real changes made, 22 to missing)

. drop tc_dup

. 
. // One LDL outlier
. replace ldl=. if ldl>=9
(1 real change made, 1 to missing)

. //graph box ldl
. 
. // Setting CRP >100 to missing, as it indicates bacterial infection
. replace crp=. if crp > 100
(4 real changes made, 4 to missing)

. // Gen logged value
. gen crp_l = log(crp)
(869 missing values generated)

. //histogram crp_l
. 
. // And logged TG
. gen tg_l = log(tg)
(448 missing values generated)

. //histogram tg_l
. // One outlier..
. replace tg_l=. if tg_l<-2
(1 real change made, 1 to missing)

. 
. /// Standardizing variables for analyses
> foreach y of varlist bmi tc hdl ldl crp_l tg_l   {
  2.         egen z_`y' = std(`y')
  3.         }
(1 missing value generated)
(26 missing values generated)
(491 missing values generated)
(1,306 missing values generated)
(869 missing values generated)
(449 missing values generated)

.         
. /// WHR is standardized by sex
> egen whr_sexm= mean(whr), by(sex)

. egen whr_sexsd= sd(whr), by(sex)

. gen z_whr= (whr-whr_sexm)/whr_sexsd
(140 missing values generated)

. 
. // study as numeric
. encode study_main, gen(study_n)

. 
. // study as dummy
. gen satsa=0

. gen octo=0

. gen gender=0

. gen harmony=0

. gen twingene=0

. replace satsa=1 if study_main=="SATSA"
(750 real changes made)

. replace octo=1 if study_main=="OCTOtw"
(425 real changes made)

. replace gender=1 if study_main=="GENDER"
(480 real changes made)

. replace twingene=1 if study_main=="TwinGene"
(5,828 real changes made)

. 
. // sex as binary
. gen bsex=sex-1

. 
. // recode fasting to binary (and assign missing as fasting..)
. recode fasting 2=0
(6037 changes made to fasting)

. recode fasting .=0
(841 changes made to fasting)

. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                 ///// SETTING
>  UP THE SURVIVAL DATA /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Generate age at end of follow-up
. gen age_exit=min(lastage, dem_onset)

. list lastage dem_onset age_exit in 1/20

     +-------------------------------+
     | lastage   dem_on~t   age_exit |
     |-------------------------------|
  1. |      89          .         89 |
  2. |      90          .         90 |
  3. |      90         89         89 |
  4. |      83          .         83 |
  5. |      82          .         82 |
     |-------------------------------|
  6. |      90          .         90 |
  7. |      90          .         90 |
  8. |      90          .         90 |
  9. |      87         84         84 |
 10. |      95          .         95 |
     |-------------------------------|
 11. | 1.0e+02         90         90 |
 12. |      91          .         91 |
 13. |      87         81         81 |
 14. |      94          .         94 |
 15. |      88          .         88 |
     |-------------------------------|
 16. |      92          .         92 |
 17. |      95         86         86 |
 18. |      91          .         91 |
 19. |      81          .         81 |
 20. |      84          .         84 |
     +-------------------------------+

. // Drop individuals who were already demented or has no registry info at base
> line
. drop if age >= age_exit
(226 observations deleted)

. // 226 deleted
. 
. // Check remaining nr of cases
. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,257       86.22       86.22
          1 |      1,000       13.78      100.00
------------+-----------------------------------
      Total |      7,257      100.00

. // 1000 dementia cases remaining, 6257 ctrls
. 
. stset age_exit, failure(dementia==1) id(twinnr) enter(age)

Survival-time data settings

           ID variable: twinnr
         Failure event: dementia==1
Observed time interval: (age_exit[_n-1], age_exit]
     Enter on or after: time age
     Exit on or before: failure

--------------------------------------------------------------------------
      7,257  total observations
          0  exclusions
--------------------------------------------------------------------------
      7,257  observations remaining, representing
      7,257  subjects
      1,000  failures in single-failure-per-subject data
 65,549.903  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =        65
                                          Last observed exit t =       106

. 
. list twinnr age dem_onset age_exit _st _t0 _t _d dementia in 1/20, noobs

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |    241 |          79 |        . |       89 |   1 |        79 | 89 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |    242 |          79 |        . |       90 |   1 |        79 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2171 |          79 |       89 |       89 |   1 |        79 | 89 |  1 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       1                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2321 |          80 |        . |       83 |   1 |        80 | 83 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2322 |          80 |        . |       82 |   1 |        80 | 82 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2381 |          78 |        . |       90 |   1 |        78 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2592 |          79 |        . |       90 |   1 |        79 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2661 |          80 |        . |       90 |   1 |        80 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |   2671 |          78 |       84 |       84 |   1 |        78 | 84 |  1 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       1                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  11501 | 87.98356345 |        . |       95 |   1 | 87.983563 | 95 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  11502 | 87.98356345 |       90 |       90 |   1 | 87.983563 | 90 |  1 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       1                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  11921 | 86.15181898 |        . |       91 |   1 | 86.151819 | 91 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  13322 | 86.10798817 |        . |       94 |   1 | 86.107988 | 94 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  17811 |  83.8086785 |        . |       88 |   1 | 83.808679 | 88 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  17812 | 82.65570896 |        . |       92 |   1 | 82.655709 | 92 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  19722 | 89.78507871 |        . |       91 |   1 | 89.785079 | 91 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21121 |          79 |        . |       81 |   1 |        79 | 81 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21122 |          79 |        . |       84 |   1 |        79 | 84 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21191 |          79 |        . |       90 |   1 |        79 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21192 |          79 |       89 |       89 |   1 |        79 | 89 |  1 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       1                                |
  +------------------------------------------------------------------------+

. stdes

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

                                   |-------------- Per subject --------------|
Category                   Total        Mean         Min     Median        Max
------------------------------------------------------------------------------
Number of subjects          7257   
Number of records           7257           1           1          1          1

Entry time (first)                  72.12954          65         71   89.96304
Exit time (final)                   81.16219          66         80        106

Subjects with gap              0   
Time on gap                    0           .           .          .          .
Time at risk           65549.903    9.032645    .0212183         10   30.58333

Failures                    1000     .137798           0          0          1
------------------------------------------------------------------------------

. 
. drop if _st!=1
(0 observations deleted)

. // n=0
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    /////  SURVIVAL MODELS, MEN /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Base model of BMI and WHR, full sample
. stcox z_bmi educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2486.2374
Iteration 1:   log pseudolikelihood = -2485.5007
Iteration 2:   log pseudolikelihood = -2485.5007
Refining estimates:
Iteration 0:   log pseudolikelihood = -2485.5007

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      3,347                            Number of obs =  3,347
No. of failures =        424
Time at risk    = 29,265.531
                                                        Wald chi2(2)  =   1.53
Log pseudolikelihood = -2485.5007                       Prob > chi2   = 0.4662

                             (Std. err. adjusted for 2,569 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9721786   .0630324    -0.44   0.663     .8561648    1.103913
        educ |   .8909475    .087441    -1.18   0.239     .7350417    1.079922
------------------------------------------------------------------------------

. stcox z_whr educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2440.8378
Iteration 1:   log pseudolikelihood = -2439.6763
Iteration 2:   log pseudolikelihood = -2439.6763
Refining estimates:
Iteration 0:   log pseudolikelihood = -2439.6763

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,288                           Number of obs =  3,288
No. of failures =         416
Time at risk    = 28,722.9271
                                                        Wald chi2(2)  =   2.46
Log pseudolikelihood = -2439.6763                       Prob > chi2   = 0.2928

                             (Std. err. adjusted for 2,536 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.055938    .050592     1.14   0.256     .9612925    1.159901
        educ |   .9028652    .089191    -1.03   0.301      .743936    1.095747
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .9721786   .0630324    -0.44   0.663     .8561648    1.10391
> 3
>        z_whr |   1.055938    .050592     1.14   0.256     .9612925    1.15990
> 1
> -----------------------------------------------------------------------------
> -*/
. 
. // BMI, adjusted for WHR, and vice versa 
. stcox z_bmi z_whr educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2440.8378
Iteration 1:   log pseudolikelihood = -2439.2161
Iteration 2:   log pseudolikelihood =  -2439.216
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2439.216

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,288                           Number of obs =  3,288
No. of failures =         416
Time at risk    = 28,722.9271
                                                        Wald chi2(3)  =   3.75
Log pseudolikelihood = -2439.216                        Prob > chi2   = 0.2903

                             (Std. err. adjusted for 2,536 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9338655   .0679731    -0.94   0.347     .8097074    1.077062
       z_whr |   1.084585   .0573274     1.54   0.124     .9778496    1.202971
        educ |   .8959113   .0884734    -1.11   0.266     .7382556    1.087235
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .9338655   .0679731    -0.94   0.347     .8097074    1.07706
> 2
>        z_whr |   1.084585   .0573274     1.54   0.124     .9778496    1.20297
> 1
> -----------------------------------------------------------------------------
> -*/
. 
. // Loop over models for BMI, WHR, and biomarkers
. foreach ad_measure in z_bmi z_whr {
  2. 
.         cap postclose coxreg_dem
  3.                 postfile coxreg_dem str20  (exp_var base_lin base_bmi base
> _biom adj_bmi adj_biom) ///
>                 using P:\Dementia_IK\FORTE_postdoc\Aim_2\Output\BMI_dem_media
> tion_20210824_late_men_`ad_measure'.dta, replace
  4.         foreach exp_var in z_crp_l z_tc z_hdl z_ldl z_tg_l {
  5.                 set more off
  6.                 
.                 // BMI/WHR on the biomarker
.                 regress `exp_var' `ad_measure' educ fasting i.study_n if(sex=
> =1), vce(cluster pairid)
  7.                 lincom `ad_measure' 
  8.                         local m_lin = r(estimate)
  9.                         local se_lin = r(se)
 10.                         local Lci_lin = `m_lin'-1.96*`se_lin'
 11.                         local Uci_lin = `m_lin'+1.96*`se_lin'
 12.                         local base_lin= string(`m_lin',"%9.2f")+" ("+strin
> g(`Lci_lin',"%9.2f")+"-"+string(`Uci_lin',"%9.2f")+")"  
 13.                         
.                 // Base model
.                 stcox `ad_measure'  educ if(`exp_var'!=. & sex==1), vce(clust
> er pairid) strata(study_main)
 14.                 lincom `ad_measure' 
 15.                         local m_m0 = r(estimate)
 16.                         local se_m0 = r(se)
 17.                         local Lci_m0 = exp(`m_m0'-1.96*`se_m0')
 18.                         local Uci_m0 = exp(`m_m0'+1.96*`se_m0')
 19.                         local base_bmi= string(exp(`m_m0'),"%9.2f")+" ("+s
> tring(`Lci_m0',"%9.2f")+"-"+string(`Uci_m0',"%9.2f")+")"  
 20.                         
.                 // Base model, biomarker
.                 stcox `exp_var'  educ fasting  if(`ad_measure'!=. & sex==1), 
> vce(cluster pairid) strata(study_main)
 21.                 lincom `exp_var' 
 22.                         local m_m1 = r(estimate)
 23.                         local se_m1 = r(se)
 24.                         local Lci_m1 = exp(`m_m1'-1.96*`se_m1')
 25.                         local Uci_m1 = exp(`m_m1'+1.96*`se_m1')
 26.                         local base_biom= string(exp(`m_m1'),"%9.2f")+" ("+
> string(`Lci_m1',"%9.2f")+"-"+string(`Uci_m1',"%9.2f")+")"  
 27.                 
.                 // Adjusted for the biomarker
.                 stcox `ad_measure' `exp_var'  educ fasting if(sex==1), vce(cl
> uster pairid) strata(study_main)
 28.                 lincom `ad_measure' 
 29.                         local m_m2 = r(estimate)
 30.                         local se_m2 = r(se)
 31.                         local Lci_m2 = exp(`m_m2'-1.96*`se_m2')
 32.                         local Uci_m2 = exp(`m_m2'+1.96*`se_m2')
 33.                         local adj_bmi= string(exp(`m_m2'),"%9.2f")+" ("+st
> ring(`Lci_m2',"%9.2f")+"-"+string(`Uci_m2',"%9.2f")+")"  
 34.                 lincom `exp_var'
 35.                         local m_m3 = r(estimate)
 36.                         local se_m3 = r(se)
 37.                         local Lci_m3 = exp(`m_m3'-1.96*`se_m3')
 38.                         local Uci_m3 = exp(`m_m3'+1.96*`se_m3')
 39.                         local adj_biom= string(exp(`m_m3'),"%9.2f")+" ("+s
> tring(`Lci_m3',"%9.2f")+"-"+string(`Uci_m3',"%9.2f")+")"  
 40. 
.                 post coxreg_dem ("`exp_var'") ("`base_lin'") ("`base_bmi'") (
> "`base_biom'") ("`adj_bmi'") ("`adj_biom'") 
 41.         }
 42.         postclose coxreg_dem
 43. }         

Linear regression                               Number of obs     =      3,037
                                                F(5, 2389)        =      19.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0328
                                                Root MSE          =     .97444

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .1837202   .0216466     8.49   0.000     .1412722    .2261683
        educ |  -.1391411   .0372164    -3.74   0.000    -.2121209   -.0661613
     fasting |  -.1767822   .1358124    -1.30   0.193    -.4431044    .0895401
             |
     study_n |
      SATSA  |   .2183138   .1655227     1.32   0.187    -.1062692    .5428968
   TwinGene  |  -.0616017   .0606164    -1.02   0.310    -.1804679    .0572646
             |
       _cons |   .1267661   .0607676     2.09   0.037     .0076034    .2459287
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1837202   .0216466     8.49   0.000     .1412722    .2261683
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2248.8111
Iteration 2:   log pseudolikelihood = -2248.8111
Refining estimates:
Iteration 0:   log pseudolikelihood = -2248.8111

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(2)  =   0.42
Log pseudolikelihood = -2248.8111                       Prob > chi2   = 0.8108

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9921833   .0678155    -0.11   0.909     .8677857    1.134413
        educ |    .934611   .0983118    -0.64   0.520      .760489      1.1486
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0078474   .0683498    -0.11   0.909    -.1418104    .1261157
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2246.0727
Iteration 2:   log pseudolikelihood = -2246.0725
Refining estimates:
Iteration 0:   log pseudolikelihood = -2246.0725

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(3)  =   6.10
Log pseudolikelihood = -2246.0725                       Prob > chi2   = 0.1071

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .8827072   .0493945    -2.23   0.026     .7910157    .9850272
        educ |   .9144526   .0964574    -0.85   0.397     .7436619    1.124467
     fasting |   .7704416   .2576529    -0.78   0.435     .4000174    1.483886
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1247618    .055958    -2.23   0.026    -.2344374   -.0150861
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2246.0555
Iteration 2:   log pseudolikelihood = -2246.0548
Refining estimates:
Iteration 0:   log pseudolikelihood = -2246.0548

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(4)  =   6.15
Log pseudolikelihood = -2246.0548                       Prob > chi2   = 0.1882

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.012578   .0699485     0.18   0.856     .8843572    1.159389
     z_crp_l |   .8812697   .0498676    -2.23   0.026     .7887561    .9846344
        educ |   .9157072   .0966416    -0.83   0.404     .7445996    1.126135
     fasting |   .7714101   .2583263    -0.78   0.438     .4001647    1.487071
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0124993   .0690796     0.18   0.856    -.1228943    .1478929
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1263915   .0565861    -2.23   0.026    -.2372982   -.0154849
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,331
                                                F(6, 2560)        =      12.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0255
                                                Root MSE          =     .92287

                             (Std. err. adjusted for 2,561 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0671627   .0192555    -3.49   0.000    -.1049206   -.0294048
        educ |  -.0091752   .0344151    -0.27   0.790    -.0766595    .0583091
     fasting |    .057278   .0936699     0.61   0.541    -.1263984    .2409545
             |
     study_n |
     OCTOtw  |  -.1650284   .1207791    -1.37   0.172    -.4018631    .0718063
      SATSA  |  -.3101822   .1039572    -2.98   0.003    -.5140309   -.1063335
   TwinGene  |  -.4751267   .0652009    -7.29   0.000    -.6029786   -.3472748
             |
       _cons |   .1179709   .0646133     1.83   0.068    -.0087288    .2446706
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0671627   .0192555    -3.49   0.000    -.1049206   -.0294048
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -2469.728
Iteration 1:   log pseudolikelihood = -2468.9049
Iteration 2:   log pseudolikelihood = -2468.9049
Refining estimates:
Iteration 0:   log pseudolikelihood = -2468.9049

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,331                           Number of obs =  3,331
No. of failures =         422
Time at risk    = 29,128.4366
                                                        Wald chi2(2)  =   1.71
Log pseudolikelihood = -2468.9049                       Prob > chi2   = 0.4262

                             (Std. err. adjusted for 2,561 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9710105   .0632858    -0.45   0.652     .8545682    1.103319
        educ |    .884569   .0870582    -1.25   0.213      .729386    1.072768
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   -.029418   .0651752    -0.45   0.652     -.157159     .098323
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -2469.728
Iteration 1:   log pseudolikelihood = -2465.3951
Iteration 2:   log pseudolikelihood =  -2465.392
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2465.392

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,331                           Number of obs =  3,331
No. of failures =         422
Time at risk    = 29,128.4366
                                                        Wald chi2(3)  =   8.91
Log pseudolikelihood = -2465.392                        Prob > chi2   = 0.0305

                             (Std. err. adjusted for 2,561 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   .9542521   .0528993    -0.84   0.398     .8560053    1.063775
        educ |   .8888021   .0875892    -1.20   0.232     .7326917    1.078174
     fasting |   .4848413   .1342604    -2.61   0.009     .2817657    .8342786
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0468274   .0554354    -0.84   0.398    -.1554787     .061824
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -2469.728
Iteration 1:   log pseudolikelihood = -2465.2105
Iteration 2:   log pseudolikelihood = -2465.2076
Refining estimates:
Iteration 0:   log pseudolikelihood = -2465.2076

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,331                           Number of obs =  3,331
No. of failures =         422
Time at risk    = 29,128.4366
                                                        Wald chi2(4)  =   9.20
Log pseudolikelihood = -2465.2076                       Prob > chi2   = 0.0563

                             (Std. err. adjusted for 2,561 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9630202   .0630764    -0.58   0.565     .8469991    1.094934
        z_tc |   .9518199   .0528118    -0.89   0.373     .8537404    1.061167
        educ |   .8839809   .0871312    -1.25   0.211     .7286897    1.072366
     fasting |   .4831841   .1337749    -2.63   0.009     .2808329    .8313373
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0376809   .0654985    -0.58   0.565    -.1660557    .0906938
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0493794    .055485    -0.89   0.373    -.1581281    .0593692
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,116
                                                F(6, 2360)        =      41.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0870
                                                Root MSE          =     .77997

                             (Std. err. adjusted for 2,361 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.2699976   .0180899   -14.93   0.000    -.3054713   -.2345238
        educ |   .1138421   .0299643     3.80   0.000      .055083    .1726012
     fasting |  -.0502006   .0889284    -0.56   0.572    -.2245864    .1241853
             |
     study_n |
     OCTOtw  |   .1495874   .1671298     0.90   0.371    -.1781491    .4773239
      SATSA  |   .1687096   .1766914     0.95   0.340     -.177777    .5151961
   TwinGene  |   .0531649   .1497421     0.36   0.723    -.2404747    .3468046
             |
       _cons |  -.5286011   .1502667    -3.52   0.000    -.8232696   -.2339327
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2699976   .0180899   -14.93   0.000    -.3054713   -.2345238
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2202.4022
Iteration 1:   log pseudolikelihood =  -2201.049
Iteration 2:   log pseudolikelihood = -2201.0488
Refining estimates:
Iteration 0:   log pseudolikelihood = -2201.0488

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,116                           Number of obs =  3,116
No. of failures =         366
Time at risk    = 27,194.1457
                                                        Wald chi2(2)  =   2.79
Log pseudolikelihood = -2201.0488                       Prob > chi2   = 0.2473

                             (Std. err. adjusted for 2,361 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9235101     .06375    -1.15   0.249     .8066463    1.057305
        educ |   .8732104   .0926796    -1.28   0.201     .7092107    1.075134
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0795735   .0690301    -1.15   0.249      -.21487     .055723
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2202.4022
Iteration 1:   log pseudolikelihood =  -2197.393
Iteration 2:   log pseudolikelihood = -2197.3883
Refining estimates:
Iteration 0:   log pseudolikelihood = -2197.3883

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,116                           Number of obs =  3,116
No. of failures =         366
Time at risk    = 27,194.1457
                                                        Wald chi2(3)  =  10.66
Log pseudolikelihood = -2197.3883                       Prob > chi2   = 0.0137

                             (Std. err. adjusted for 2,361 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   .9212327   .0611706    -1.24   0.217     .8088144    1.049276
        educ |   .8974586   .0957254    -1.01   0.310     .7281535    1.106129
     fasting |   .4545602   .1287668    -2.78   0.005     .2608945    .7919867
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0820426   .0664008    -1.24   0.217    -.2121858    .0481006
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2202.4022
Iteration 1:   log pseudolikelihood = -2196.0446
Iteration 2:   log pseudolikelihood = -2196.0401
Refining estimates:
Iteration 0:   log pseudolikelihood = -2196.0401

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,116                           Number of obs =  3,116
No. of failures =         366
Time at risk    = 27,194.1457
                                                        Wald chi2(4)  =  13.14
Log pseudolikelihood = -2196.0401                       Prob > chi2   = 0.0106

                             (Std. err. adjusted for 2,361 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8915845   .0644522    -1.59   0.112     .7738015    1.027296
       z_hdl |   .8925155   .0615755    -1.65   0.099     .7796336    1.021741
        educ |   .8845211   .0943476    -1.15   0.250     .7176532    1.090189
     fasting |   .4523931   .1279967    -2.80   0.005     .2598265    .7876777
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   -.114755   .0722895    -1.59   0.112    -.2564399    .0269298
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1137113    .068991    -1.65   0.099    -.2489312    .0215085
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,823
                                                F(5, 2189)        =       4.29
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0086
                                                Root MSE          =     .98223

                             (Std. err. adjusted for 2,190 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0971847   .0233795    -4.16   0.000     -.143033   -.0513364
        educ |   .0160869   .0393782     0.41   0.683    -.0611357    .0933095
     fasting |  -.0350529   .1393062    -0.25   0.801    -.3082392    .2381333
             |
     study_n |
      SATSA  |   .0586529   .2400222     0.24   0.807    -.4120422    .5293479
   TwinGene  |   .1867767    .178076     1.05   0.294    -.1624389    .5359923
             |
       _cons |  -.3440272   .1794561    -1.92   0.055    -.6959494    .0078949
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0971847   .0233795    -4.16   0.000     -.143033   -.0513364
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1954.3914
Iteration 1:   log pseudolikelihood =  -1953.928
Iteration 2:   log pseudolikelihood = -1953.9279
Refining estimates:
Iteration 0:   log pseudolikelihood = -1953.9279

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,823                           Number of obs =  2,823
No. of failures =         311
Time at risk    = 25,074.8556
                                                        Wald chi2(2)  =   0.91
Log pseudolikelihood = -1953.9279                       Prob > chi2   = 0.6341

                             (Std. err. adjusted for 2,190 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9354508   .0696555    -0.90   0.370     .8084232    1.082438
        educ |   .9561004   .1112822    -0.39   0.700     .7610806    1.201092
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0667267    .074462    -0.90   0.370    -.2126695    .0792161
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1954.3914
Iteration 1:   log pseudolikelihood =   -1953.76
Iteration 2:   log pseudolikelihood = -1953.7555
Iteration 3:   log pseudolikelihood = -1953.7555
Refining estimates:
Iteration 0:   log pseudolikelihood = -1953.7555

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,823                           Number of obs =  2,823
No. of failures =         311
Time at risk    = 25,074.8556
                                                        Wald chi2(3)  =   1.67
Log pseudolikelihood = -1953.7555                       Prob > chi2   = 0.6438

                             (Std. err. adjusted for 2,190 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.012443   .0624631     0.20   0.841     .8971303    1.142578
        educ |   .9651608   .1123011    -0.30   0.761     .7683486    1.212386
     fasting |   .6600311   .2244791    -1.22   0.222     .3388969    1.285468
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0123665   .0616954     0.20   0.841    -.1085542    .1332873
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1954.3914
Iteration 1:   log pseudolikelihood = -1953.3258
Iteration 2:   log pseudolikelihood = -1953.3215
Iteration 3:   log pseudolikelihood = -1953.3215
Refining estimates:
Iteration 0:   log pseudolikelihood = -1953.3215

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,823                           Number of obs =  2,823
No. of failures =         311
Time at risk    = 25,074.8556
                                                        Wald chi2(4)  =   2.43
Log pseudolikelihood = -1953.3215                       Prob > chi2   = 0.6565

                             (Std. err. adjusted for 2,190 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9342438   .0698474    -0.91   0.363     .8069032    1.081681
       z_ldl |   1.006757   .0624826     0.11   0.914     .8914488    1.136981
        educ |   .9546943   .1112245    -0.40   0.691      .759796    1.199587
     fasting |    .653935   .2235437    -1.24   0.214     .3346236    1.277946
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0680178   .0747635    -0.91   0.363    -.2145516     .078516
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0067344   .0620632     0.11   0.914    -.1149073    .1283761
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,193
                                                F(5, 2467)        =     104.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1402
                                                Root MSE          =     .96253

                             (Std. err. adjusted for 2,468 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .4057045   .0204416    19.85   0.000     .3656201    .4457889
        educ |  -.1436737   .0366999    -3.91   0.000    -.2156395   -.0717079
     fasting |     .04676   .1024266     0.46   0.648    -.1540909    .2476109
             |
     study_n |
      SATSA  |  -.3770307   .1182857    -3.19   0.001    -.6089803   -.1450811
   TwinGene  |  -.5660528   .0722582    -7.83   0.000    -.7077458   -.4243598
             |
       _cons |   .5632415   .0719621     7.83   0.000     .4221291    .7043539
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4057045   .0204416    19.85   0.000     .3656201    .4457889
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2350.5339
Iteration 1:   log pseudolikelihood = -2350.2236
Iteration 2:   log pseudolikelihood = -2350.2236
Refining estimates:
Iteration 0:   log pseudolikelihood = -2350.2236

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,193                           Number of obs =  3,193
No. of failures =         391
Time at risk    = 28,505.1313
                                                        Wald chi2(2)  =   0.63
Log pseudolikelihood = -2350.2236                       Prob > chi2   = 0.7310

                             (Std. err. adjusted for 2,468 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9657188   .0652036    -0.52   0.605     .8460169    1.102357
        educ |   .9386684    .096686    -0.61   0.539      .767071    1.148653
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0348826   .0675182    -0.52   0.605    -.1672159    .0974508
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2350.5339
Iteration 1:   log pseudolikelihood = -2345.5728
Iteration 2:   log pseudolikelihood = -2345.5687
Refining estimates:
Iteration 0:   log pseudolikelihood = -2345.5687

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,193                           Number of obs =  3,193
No. of failures =         391
Time at risk    = 28,505.1313
                                                        Wald chi2(3)  =  11.58
Log pseudolikelihood = -2345.5687                       Prob > chi2   = 0.0090

                             (Std. err. adjusted for 2,468 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |   1.091836   .0524949     1.83   0.068     .9936465    1.199727
        educ |   .9581692   .0988904    -0.41   0.679     .7826934    1.172986
     fasting |    .479437   .1330755    -2.65   0.008     .2782703    .8260308
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0878602   .0480795     1.83   0.068    -.0063738    .1820942
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2350.5339
Iteration 1:   log pseudolikelihood = -2344.7958
Iteration 2:   log pseudolikelihood = -2344.7916
Refining estimates:
Iteration 0:   log pseudolikelihood = -2344.7916

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,193                           Number of obs =  3,193
No. of failures =         391
Time at risk    = 28,505.1313
                                                        Wald chi2(4)  =  12.99
Log pseudolikelihood = -2344.7916                       Prob > chi2   = 0.0113

                             (Std. err. adjusted for 2,468 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9189006   .0667086    -1.17   0.244     .7970299    1.059406
      z_tg_l |   1.115506   .0570326     2.14   0.033     1.009142     1.23308
        educ |   .9511564   .0981113    -0.49   0.627     .7770535    1.164268
     fasting |   .4747066    .131324    -2.69   0.007      .276024    .8164013
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0845773   .0725961    -1.17   0.244     -.226863    .0577084
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1093082   .0511271     2.14   0.033     .0091008    .2095155
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,004
                                                F(5, 2367)        =      27.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0474
                                                Root MSE          =     .96523

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .1936787   .0184621    10.49   0.000     .1574751    .2298822
        educ |  -.1421418   .0369919    -3.84   0.000    -.2146817    -.069602
     fasting |  -.1840781   .1371488    -1.34   0.180    -.4530222    .0848661
             |
     study_n |
      SATSA  |   .2822978    .166429     1.70   0.090    -.0440639    .6086594
   TwinGene  |  -.0066424   .0591111    -0.11   0.911    -.1225572    .1092724
             |
       _cons |   .0892359   .0593178     1.50   0.133    -.0270843    .2055561
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1936787   .0184621    10.49   0.000     .1574751    .2298822
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2228.5207
Iteration 2:   log pseudolikelihood = -2228.5206
Refining estimates:
Iteration 0:   log pseudolikelihood = -2228.5206

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(2)  =   2.45
Log pseudolikelihood = -2228.5206                       Prob > chi2   = 0.2944

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.075768   .0545789     1.44   0.150     .9739421     1.18824
        educ |   .9423821   .0992394    -0.56   0.573     .7666365    1.158416
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0730349   .0507348     1.44   0.150    -.0264035    .1724733
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2226.7405
Iteration 2:   log pseudolikelihood = -2226.7404
Refining estimates:
Iteration 0:   log pseudolikelihood = -2226.7404

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(3)  =   5.99
Log pseudolikelihood = -2226.7404                       Prob > chi2   = 0.1119

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |     .88176   .0496111    -2.24   0.025     .7896936      .98456
        educ |   .9179166    .097214    -0.81   0.419     .7458556     1.12967
     fasting |   .7805259   .2624796    -0.74   0.461      .403776    1.508808
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1258353   .0562637    -2.24   0.025    -.2361102   -.0155604
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2225.1087
Iteration 2:   log pseudolikelihood = -2225.1069
Refining estimates:
Iteration 0:   log pseudolikelihood = -2225.1069

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(4)  =  10.00
Log pseudolikelihood = -2225.1069                       Prob > chi2   = 0.0404

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.101824   .0565621     1.89   0.059     .9963589    1.218452
     z_crp_l |   .8651613   .0496118    -2.53   0.012     .7731892    .9680736
        educ |   .9194564   .0971797    -0.79   0.427     .7474212    1.131089
     fasting |   .7857412   .2629598    -0.72   0.471     .4077674    1.514072
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0969669    .051335     1.89   0.059    -.0036478    .1975816
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1448393    .057344    -2.53   0.012    -.2572315   -.0324472
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,272
                                                F(6, 2527)        =      10.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0213
                                                Root MSE          =     .92305

                             (Std. err. adjusted for 2,528 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0167836   .0168304    -1.00   0.319    -.0497864    .0162192
        educ |  -.0014955   .0347736    -0.04   0.966    -.0696833    .0666922
     fasting |   .0322898   .0969423     0.33   0.739    -.1578047    .2223843
             |
     study_n |
     OCTOtw  |   -.135738   .1203605    -1.13   0.260    -.3717534    .1002773
      SATSA  |  -.2992973   .1073675    -2.79   0.005    -.5098345   -.0887601
   TwinGene  |  -.4685039    .065353    -7.17   0.000    -.5966548    -.340353
             |
       _cons |   .1046635   .0646638     1.62   0.106     -.022136    .2314629
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0167836   .0168304    -1.00   0.319    -.0497864    .0162192
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2424.3603
Iteration 1:   log pseudolikelihood = -2423.1216
Iteration 2:   log pseudolikelihood = -2423.1215
Refining estimates:
Iteration 0:   log pseudolikelihood = -2423.1215

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,272                           Number of obs =  3,272
No. of failures =         414
Time at risk    = 28,585.8326
                                                        Wald chi2(2)  =   2.60
Log pseudolikelihood = -2423.1215                       Prob > chi2   = 0.2723

                             (Std. err. adjusted for 2,528 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.056095   .0508624     1.13   0.257     .9609665     1.16064
        educ |   .8961825   .0887636    -1.11   0.268     .7380538     1.08819
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0545779   .0481609     1.13   0.257    -.0398157    .1489714
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2424.3603
Iteration 1:   log pseudolikelihood = -2421.2856
Iteration 2:   log pseudolikelihood = -2421.2831
Refining estimates:
Iteration 0:   log pseudolikelihood = -2421.2831

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,272                           Number of obs =  3,272
No. of failures =         414
Time at risk    = 28,585.8326
                                                        Wald chi2(3)  =   6.61
Log pseudolikelihood = -2421.2831                       Prob > chi2   = 0.0854

                             (Std. err. adjusted for 2,528 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   .9584718   .0536731    -0.76   0.449     .8588419    1.069659
        educ |   .8896455   .0881215    -1.18   0.238     .7326617    1.080265
     fasting |   .5361254   .1548756    -2.16   0.031      .304349    .9444108
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0424151   .0559986    -0.76   0.449    -.1521704    .0673402
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2424.3603
Iteration 1:   log pseudolikelihood = -2420.6583
Iteration 2:   log pseudolikelihood = -2420.6551
Refining estimates:
Iteration 0:   log pseudolikelihood = -2420.6551

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,272                           Number of obs =  3,272
No. of failures =         414
Time at risk    = 28,585.8326
                                                        Wald chi2(4)  =   7.86
Log pseudolikelihood = -2420.6551                       Prob > chi2   = 0.0967

                             (Std. err. adjusted for 2,528 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.057657   .0508018     1.17   0.243     .9626306    1.162064
        z_tc |   .9585407   .0536803    -0.76   0.450     .8588978    1.069743
        educ |   .8931048   .0884199    -1.14   0.253      .735582    1.084361
     fasting |   .5326417   .1544559    -2.17   0.030     .3017192    .9403019
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0560563   .0480324     1.17   0.243    -.0380855    .1501982
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0423433   .0560021    -0.76   0.450    -.1521054    .0674188
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,062
                                                F(6, 2329)        =      29.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0610
                                                Root MSE          =     .79041

                             (Std. err. adjusted for 2,330 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.1810618   .0148833   -12.17   0.000    -.2102477   -.1518759
        educ |   .1271725   .0304924     4.17   0.000     .0673775    .1869675
     fasting |  -.0907786   .0994404    -0.91   0.361    -.2857796    .1042223
             |
     study_n |
     OCTOtw  |   .1952135   .1738473     1.12   0.262    -.1456981    .5361252
      SATSA  |   .2615572   .1909278     1.37   0.171    -.1128491    .6359634
   TwinGene  |   .0222338   .1574025     0.14   0.888    -.2864298    .3308974
             |
       _cons |  -.5235376   .1577599    -3.32   0.001    -.8329022    -.214173
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1810618   .0148833   -12.17   0.000    -.2102477   -.1518759
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2157.9246
Iteration 1:   log pseudolikelihood = -2156.8776
Iteration 2:   log pseudolikelihood = -2156.8775
Refining estimates:
Iteration 0:   log pseudolikelihood = -2156.8775

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      3,062                            Number of obs =  3,062
No. of failures =        358
Time at risk    = 26,681.193
                                                        Wald chi2(2)  =   2.18
Log pseudolikelihood = -2156.8775                       Prob > chi2   = 0.3357

                             (Std. err. adjusted for 2,330 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.054418   .0531574     1.05   0.293      .955213    1.163926
        educ |   .8973353    .096034    -1.01   0.311     .7275419    1.106755
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0529887    .050414     1.05   0.293     -.045821    .1517984
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2157.9246
Iteration 1:   log pseudolikelihood = -2154.3207
Iteration 2:   log pseudolikelihood = -2154.3158
Refining estimates:
Iteration 0:   log pseudolikelihood = -2154.3158

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      3,062                            Number of obs =  3,062
No. of failures =        358
Time at risk    = 26,681.193
                                                        Wald chi2(3)  =   7.74
Log pseudolikelihood = -2154.3158                       Prob > chi2   = 0.0518

                             (Std. err. adjusted for 2,330 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   .9258539   .0625929    -1.14   0.254     .8109544    1.057033
        educ |   .8999063   .0966457    -0.98   0.326     .7290919     1.11074
     fasting |   .4993901   .1518368    -2.28   0.022     .2751927    .9062395
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0770389   .0676056    -1.14   0.254    -.2095434    .0554657
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2157.9246
Iteration 1:   log pseudolikelihood =  -2153.967
Iteration 2:   log pseudolikelihood = -2153.9615
Refining estimates:
Iteration 0:   log pseudolikelihood = -2153.9615

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      3,062                            Number of obs =  3,062
No. of failures =        358
Time at risk    = 26,681.193
                                                        Wald chi2(4)  =   8.60
Log pseudolikelihood = -2153.9615                       Prob > chi2   = 0.0719

                             (Std. err. adjusted for 2,330 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.046239   .0540776     0.87   0.382     .9454412    1.157784
       z_hdl |   .9356394   .0647249    -0.96   0.336     .8170051      1.0715
        educ |    .901712   .0967296    -0.96   0.335     .7307296    1.112702
     fasting |   .4969086   .1512397    -2.30   0.022     .2736553    .9022963
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0452022   .0516876     0.87   0.382    -.0561036     .146508
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0665251   .0691772    -0.96   0.336      -.20211    .0690598
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,788
                                                F(5, 2168)        =       1.78
                                                Prob > F          =     0.1127
                                                R-squared         =     0.0036
                                                Root MSE          =     .98513

                             (Std. err. adjusted for 2,169 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0429815   .0194141    -2.21   0.027    -.0810538   -.0049093
        educ |   .0232332   .0397774     0.58   0.559    -.0547725     .101239
     fasting |  -.0518133   .1390514    -0.37   0.709    -.3245013    .2208746
             |
     study_n |
      SATSA  |   .0707584   .2368149     0.30   0.765    -.3936495    .5351663
   TwinGene  |   .1771564   .1760208     1.01   0.314    -.1680307    .5223434
             |
       _cons |  -.3424607   .1773968    -1.93   0.054    -.6903464    .0054249
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0429815   .0194141    -2.21   0.027    -.0810538   -.0049093
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1935.1065
Iteration 1:   log pseudolikelihood =   -1934.13
Iteration 2:   log pseudolikelihood =   -1934.13
Refining estimates:
Iteration 0:   log pseudolikelihood =   -1934.13

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,788                           Number of obs =  2,788
No. of failures =         308
Time at risk    = 24,752.7577
                                                        Wald chi2(2)  =   2.09
Log pseudolikelihood = -1934.13                         Prob > chi2   = 0.3511

                             (Std. err. adjusted for 2,169 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.080253   .0584076     1.43   0.153     .9716332    1.201016
        educ |   .9752434    .113566    -0.22   0.830      .776232    1.225278
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0771954   .0540685     1.43   0.153    -.0287769    .1831677
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1935.1065
Iteration 1:   log pseudolikelihood = -1934.5453
Iteration 2:   log pseudolikelihood = -1934.5413
Iteration 3:   log pseudolikelihood = -1934.5413
Refining estimates:
Iteration 0:   log pseudolikelihood = -1934.5413

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,788                           Number of obs =  2,788
No. of failures =         308
Time at risk    = 24,752.7577
                                                        Wald chi2(3)  =   1.49
Log pseudolikelihood = -1934.5413                       Prob > chi2   = 0.6843

                             (Std. err. adjusted for 2,169 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |    1.00558   .0622349     0.09   0.928     .8907095    1.135264
        educ |   .9698353    .113391    -0.26   0.793     .7712184    1.219603
     fasting |   .6687135    .229131    -1.17   0.240     .3416493    1.308879
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0055643   .0618895     0.09   0.928    -.1157369    .1268656
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -1935.1065
Iteration 1:   log pseudolikelihood = -1933.6104
Iteration 2:   log pseudolikelihood = -1933.6064
Iteration 3:   log pseudolikelihood = -1933.6064
Refining estimates:
Iteration 0:   log pseudolikelihood = -1933.6064

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,788                           Number of obs =  2,788
No. of failures =         308
Time at risk    = 24,752.7577
                                                        Wald chi2(4)  =   3.61
Log pseudolikelihood = -1933.6064                       Prob > chi2   = 0.4615

                             (Std. err. adjusted for 2,169 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.079744    .058249     1.42   0.155     .9714067    1.200164
       z_ldl |     1.0072   .0620561     0.12   0.907     .8926287    1.136476
        educ |   .9735752   .1135004    -0.23   0.818     .7747036    1.223499
     fasting |    .672076   .2299544    -1.16   0.245     .3436966      1.3142
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0767243   .0539471     1.42   0.155    -.0290101    .1824586
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0071738   .0616126     0.12   0.907    -.1135846    .1279322
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,134
                                                F(5, 2434)        =      75.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1058
                                                Root MSE          =     .98063

                             (Std. err. adjusted for 2,435 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2809671   .0173741    16.17   0.000     .2468976    .3150366
        educ |    -.17119   .0374607    -4.57   0.000    -.2446481   -.0977319
     fasting |   .0226767   .1102575     0.21   0.837    -.1935317     .238885
             |
     study_n |
      SATSA  |  -.4131496   .1257675    -3.29   0.001    -.6597719   -.1665272
   TwinGene  |  -.4960695   .0742129    -6.68   0.000    -.6415965   -.3505425
             |
       _cons |   .5381552   .0737555     7.30   0.000     .3935252    .6827852
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2809671   .0173741    16.17   0.000     .2468976    .3150366
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2305.1654
Iteration 1:   log pseudolikelihood = -2304.2579
Iteration 2:   log pseudolikelihood = -2304.2579
Refining estimates:
Iteration 0:   log pseudolikelihood = -2304.2579

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,134                           Number of obs =  3,134
No. of failures =         383
Time at risk    = 27,962.5274
                                                        Wald chi2(2)  =   1.91
Log pseudolikelihood = -2304.2579                       Prob > chi2   = 0.3857

                             (Std. err. adjusted for 2,435 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.066765   .0533302     1.29   0.196     .9671968    1.176582
        educ |   .9522951   .0988267    -0.47   0.638     .7770269    1.167097
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0646302   .0499925     1.29   0.196    -.0333533    .1626137
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2305.1654
Iteration 1:   log pseudolikelihood = -2301.4263
Iteration 2:   log pseudolikelihood = -2301.4228
Refining estimates:
Iteration 0:   log pseudolikelihood = -2301.4228

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,134                           Number of obs =  3,134
No. of failures =         383
Time at risk    = 27,962.5274
                                                        Wald chi2(3)  =   8.87
Log pseudolikelihood = -2301.4228                       Prob > chi2   = 0.0311

                             (Std. err. adjusted for 2,435 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |    1.09101   .0530263     1.79   0.073     .9918775    1.200051
        educ |   .9600728   .0996731    -0.39   0.695     .7833104    1.176723
     fasting |   .5321242   .1541117    -2.18   0.029     .3016417     .938717
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0871043   .0486029     1.79   0.073    -.0081556    .1823642
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2305.1654
Iteration 1:   log pseudolikelihood = -2301.0389
Iteration 2:   log pseudolikelihood = -2301.0351
Refining estimates:
Iteration 0:   log pseudolikelihood = -2301.0351

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,134                           Number of obs =  3,134
No. of failures =         383
Time at risk    = 27,962.5274
                                                        Wald chi2(4)  =   9.77
Log pseudolikelihood = -2301.0351                       Prob > chi2   = 0.0445

                             (Std. err. adjusted for 2,435 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.048299   .0550358     0.90   0.369     .9457949    1.161912
      z_tg_l |   1.078865   .0549751     1.49   0.136     .9763218    1.192179
        educ |   .9609255   .0996963    -0.38   0.701     .7841107    1.177612
     fasting |   .5298776   .1540498    -2.18   0.029     .2997148    .9367915
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0471689   .0525001     0.90   0.369    -.0557295    .1500673
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0759097   .0509564     1.49   0.136     -.023963    .1757824
------------------------------------------------------------------------------

. 
. /// Adding CRP without fasting adjustment..
> regress z_crp_l z_bmi educ i.study_n fasting if(sex==1), vce(cluster pairid)

Linear regression                               Number of obs     =      3,037
                                                F(5, 2389)        =      19.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0328
                                                Root MSE          =     .97444

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .1837202   .0216466     8.49   0.000     .1412722    .2261683
        educ |  -.1391411   .0372164    -3.74   0.000    -.2121209   -.0661613
             |
     study_n |
      SATSA  |   .2183138   .1655227     1.32   0.187    -.1062692    .5428968
   TwinGene  |  -.0616017   .0606164    -1.02   0.310    -.1804679    .0572646
             |
     fasting |  -.1767822   .1358124    -1.30   0.193    -.4431044    .0895401
       _cons |   .1267661   .0607676     2.09   0.037     .0076034    .2459287
------------------------------------------------------------------------------

. regress z_crp_l z_whr educ i.study_n if(sex==1), vce(cluster pairid)

Linear regression                               Number of obs     =      3,004
                                                F(4, 2367)        =      33.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0467
                                                Root MSE          =     .96539

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .1940886   .0184592    10.51   0.000     .1578908    .2302865
        educ |  -.1417916   .0370072    -3.83   0.000    -.2143615   -.0692216
             |
     study_n |
      SATSA  |   .1185513   .1101804     1.08   0.282    -.0975087    .3346114
   TwinGene  |  -.0094616   .0590681    -0.16   0.873    -.1252922     .106369
             |
       _cons |   .0889447   .0593097     1.50   0.134    -.0273597    .2052492
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>      z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .1839802   .0216514     8.50   0.000     .1415228    .226437
> 6
>        z_whr |   .1940886   .0184592    10.51   0.000     .1578908    .230286
> 5
> -----------------------------------------------------------------------------
> -*/
. 
. stcox z_bmi educ if(z_crp_l!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2248.8111
Iteration 2:   log pseudolikelihood = -2248.8111
Refining estimates:
Iteration 0:   log pseudolikelihood = -2248.8111

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(2)  =   0.42
Log pseudolikelihood = -2248.8111                       Prob > chi2   = 0.8108

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9921833   .0678155    -0.11   0.909     .8677857    1.134413
        educ |    .934611   .0983118    -0.64   0.520      .760489      1.1486
------------------------------------------------------------------------------

. stcox z_whr educ if(z_crp_l!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2228.5207
Iteration 2:   log pseudolikelihood = -2228.5206
Refining estimates:
Iteration 0:   log pseudolikelihood = -2228.5206

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(2)  =   2.45
Log pseudolikelihood = -2228.5206                       Prob > chi2   = 0.2944

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.075768   .0545789     1.44   0.150     .9739421     1.18824
        educ |   .9423821   .0992394    -0.56   0.573     .7666365    1.158416
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .9921833   .0678155    -0.11   0.909     .8677857    1.13441
> 3
>        z_whr |   1.075768   .0545789     1.44   0.150     .9739421     1.1882
> 4
> -----------------------------------------------------------------------------
> -*/
.            
. stcox z_crp_l educ if(z_bmi!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2246.3228
Iteration 2:   log pseudolikelihood = -2246.3227
Refining estimates:
Iteration 0:   log pseudolikelihood = -2246.3227

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(2)  =   5.32
Log pseudolikelihood = -2246.3227                       Prob > chi2   = 0.0699

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .8835286    .049438    -2.21   0.027     .7917563    .9859383
        educ |   .9151082   .0964931    -0.84   0.400     .7442485    1.125193
------------------------------------------------------------------------------

. stcox z_crp_l educ if(z_whr!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2226.9642
Iteration 2:   log pseudolikelihood = -2226.9641
Refining estimates:
Iteration 0:   log pseudolikelihood = -2226.9641

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(2)  =   5.30
Log pseudolikelihood = -2226.9641                       Prob > chi2   = 0.0705

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .8825776   .0496541    -2.22   0.026     .7904311    .9854662
        educ |   .9185666   .0972532    -0.80   0.422     .7464311    1.130399
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>      z_crp_l |   .8835286    .049438    -2.21   0.027     .7917563    .985938
> 3
>      z_crp_l |   .8825776   .0496541    -2.22   0.026     .7904311    .985466
> 2
> -----------------------------------------------------------------------------
> -*/
. 
. stcox z_bmi z_crp_l educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2249.0139
Iteration 1:   log pseudolikelihood = -2246.3028
Iteration 2:   log pseudolikelihood = -2246.3024
Refining estimates:
Iteration 0:   log pseudolikelihood = -2246.3024

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,037                           Number of obs =  3,037
No. of failures =         370
Time at risk    = 27,114.7488
                                                        Wald chi2(3)  =   5.36
Log pseudolikelihood = -2246.3024                       Prob > chi2   = 0.1476

                             (Std. err. adjusted for 2,390 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.013491   .0699407     0.19   0.846     .8852765    1.160276
     z_crp_l |    .881993   .0499077    -2.22   0.026     .7894049    .9854406
        educ |   .9164689   .0966962    -0.83   0.408     .7452601     1.12701
------------------------------------------------------------------------------

. stcox z_whr z_crp_l educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2229.6605
Iteration 1:   log pseudolikelihood = -2225.3221
Iteration 2:   log pseudolikelihood = -2225.3203
Refining estimates:
Iteration 0:   log pseudolikelihood = -2225.3203

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,004                           Number of obs =  3,004
No. of failures =         367
Time at risk    = 26,806.5838
                                                        Wald chi2(3)  =   9.12
Log pseudolikelihood = -2225.3203                       Prob > chi2   = 0.0278

                             (Std. err. adjusted for 2,368 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.102197   .0565922     1.90   0.058     .9966767    1.218889
     z_crp_l |   .8659607   .0496653    -2.51   0.012     .7738902     .968985
        educ |   .9203038   .0972509    -0.79   0.432     .7481394    1.132087
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   1.013491   .0699407     0.19   0.846     .8852765    1.16027
> 6
>      z_crp_l |    .881993   .0499077    -2.22   0.026     .7894049    .985440
> 6
>        z_whr |   1.102197   .0565922     1.90   0.058     .9966767    1.21888
> 9
>      z_crp_l |   .8659607   .0496653    -2.51   0.012     .7738902     .96898
> 5
> -----------------------------------------------------------------------------
> -*/
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    /////  SURVIVAL MODELS, WOMEN /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Base model of BMI and WHR, full sample
. stcox z_bmi educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3426.2727
Iteration 1:   log pseudolikelihood = -3422.3799
Iteration 2:   log pseudolikelihood = -3422.3756
Refining estimates:
Iteration 0:   log pseudolikelihood = -3422.3756

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,909                           Number of obs =  3,909
No. of failures =         576
Time at risk    = 36,283.8101
                                                        Wald chi2(2)  =   7.88
Log pseudolikelihood = -3422.3756                       Prob > chi2   = 0.0195

                             (Std. err. adjusted for 2,825 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9002047   .0368104    -2.57   0.010      .830873    .9753217
        educ |   .8893273   .0755516    -1.38   0.167     .7529201    1.050447
------------------------------------------------------------------------------

. stcox z_whr educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -3300.133
Iteration 1:   log pseudolikelihood = -3299.4983
Iteration 2:   log pseudolikelihood = -3299.4983
Refining estimates:
Iteration 0:   log pseudolikelihood = -3299.4983

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,837                           Number of obs =  3,837
No. of failures =         555
Time at risk    = 35,437.8136
                                                        Wald chi2(2)  =   1.22
Log pseudolikelihood = -3299.4983                       Prob > chi2   = 0.5429

                             (Std. err. adjusted for 2,793 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9720087    .045328    -0.61   0.543     .8871065    1.065037
        educ |    .918517   .0797738    -0.98   0.328     .7747468    1.088967
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .9002047   .0368104    -2.57   0.010      .830873    .975321
> 7
>        z_whr |   .9720087    .045328    -0.61   0.543     .8871065    1.06503
> 7
>  ----------------------------------------------------------------------------
> --*/
. 
. // BMI, adjusted for WHR, and vice versa 
. stcox z_bmi z_whr educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3300.0838
Iteration 1:   log pseudolikelihood = -3295.8692
Iteration 2:   log pseudolikelihood = -3295.8629
Iteration 3:   log pseudolikelihood = -3295.8629
Refining estimates:
Iteration 0:   log pseudolikelihood = -3295.8629

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,836                           Number of obs =  3,836
No. of failures =         555
Time at risk    = 35,437.2516
                                                        Wald chi2(3)  =   8.62
Log pseudolikelihood = -3295.8629                       Prob > chi2   = 0.0347

                             (Std. err. adjusted for 2,793 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8880573   .0387228    -2.72   0.006     .8153146    .9672901
       z_whr |   1.017454   .0505319     0.35   0.728     .9230813    1.121476
        educ |   .8976159   .0782503    -1.24   0.215      .756635    1.064865
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .8880573   .0387228    -2.72   0.006     .8153146    .967290
> 1
>        z_whr |   1.017454   .0505319     0.35   0.728     .9230813    1.12147
> 6
> -----------------------------------------------------------------------------
> -*/
. 
. // Loop over models for BMI, WHR, and biomarkers
. foreach ad_measure in z_bmi z_whr {
  2. 
.         cap postclose coxreg_dem
  3.                 postfile coxreg_dem str20  (exp_var base_lin base_bmi base
> _biom adj_bmi adj_biom) ///
>                 using P:\Dementia_IK\FORTE_postdoc\Aim_2\Output\BMI_dem_media
> tion_20210824_late_women_`ad_measure'.dta, replace
  4.         foreach exp_var in z_crp_l z_tc z_hdl z_ldl z_tg_l {
  5.                 set more off
  6.                 
.                 // BMI/WHR on the biomarker
.                 regress `exp_var' `ad_measure' educ fasting i.study_n if(sex=
> =2), vce(cluster pairid)
  7.                 lincom `ad_measure' 
  8.                         local m_lin = r(estimate)
  9.                         local se_lin = r(se)
 10.                         local Lci_lin = `m_lin'-1.96*`se_lin'
 11.                         local Uci_lin = `m_lin'+1.96*`se_lin'
 12.                         local base_lin= string(`m_lin',"%9.2f")+" ("+strin
> g(`Lci_lin',"%9.2f")+"-"+string(`Uci_lin',"%9.2f")+")"  
 13.                         
.                 // Base model
.                 stcox `ad_measure'  educ if(`exp_var'!=. & sex==2), vce(clust
> er pairid) strata(study_main)
 14.                 lincom `ad_measure' 
 15.                         local m_m0 = r(estimate)
 16.                         local se_m0 = r(se)
 17.                         local Lci_m0 = exp(`m_m0'-1.96*`se_m0')
 18.                         local Uci_m0 = exp(`m_m0'+1.96*`se_m0')
 19.                         local base_bmi= string(exp(`m_m0'),"%9.2f")+" ("+s
> tring(`Lci_m0',"%9.2f")+"-"+string(`Uci_m0',"%9.2f")+")"  
 20.                         
.                 // Base model, biomarker
.                 stcox `exp_var'  educ fasting  if(`ad_measure'!=. & sex==2), 
> vce(cluster pairid) strata(study_main)
 21.                 lincom `exp_var' 
 22.                         local m_m1 = r(estimate)
 23.                         local se_m1 = r(se)
 24.                         local Lci_m1 = exp(`m_m1'-1.96*`se_m1')
 25.                         local Uci_m1 = exp(`m_m1'+1.96*`se_m1')
 26.                         local base_biom= string(exp(`m_m1'),"%9.2f")+" ("+
> string(`Lci_m1',"%9.2f")+"-"+string(`Uci_m1',"%9.2f")+")"  
 27.                 
.                 // Adjusted for the biomarker
.                 stcox `ad_measure' `exp_var'  educ fasting if(sex==2), vce(cl
> uster pairid) strata(study_main)
 28.                 lincom `ad_measure' 
 29.                         local m_m2 = r(estimate)
 30.                         local se_m2 = r(se)
 31.                         local Lci_m2 = exp(`m_m2'-1.96*`se_m2')
 32.                         local Uci_m2 = exp(`m_m2'+1.96*`se_m2')
 33.                         local adj_bmi= string(exp(`m_m2'),"%9.2f")+" ("+st
> ring(`Lci_m2',"%9.2f")+"-"+string(`Uci_m2',"%9.2f")+")"  
 34.                 lincom `exp_var'
 35.                         local m_m3 = r(estimate)
 36.                         local se_m3 = r(se)
 37.                         local Lci_m3 = exp(`m_m3'-1.96*`se_m3')
 38.                         local Uci_m3 = exp(`m_m3'+1.96*`se_m3')
 39.                         local adj_biom= string(exp(`m_m3'),"%9.2f")+" ("+s
> tring(`Lci_m3',"%9.2f")+"-"+string(`Uci_m3',"%9.2f")+")"  
 40. 
.                 post coxreg_dem ("`exp_var'") ("`base_lin'") ("`base_bmi'") (
> "`base_biom'") ("`adj_bmi'") ("`adj_biom'") 
 41.         }
 42.         postclose coxreg_dem
 43. }         

Linear regression                               Number of obs     =      3,433
                                                F(5, 2548)        =      93.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1251
                                                Root MSE          =     .93482

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .3066603   .0150343    20.40   0.000     .2771795     .336141
        educ |  -.1094481   .0343979    -3.18   0.001    -.1768987   -.0419975
     fasting |   .0697886   .1151081     0.61   0.544    -.1559264    .2955035
             |
     study_n |
      SATSA  |  -.0531631    .120951    -0.44   0.660    -.2903354    .1840092
   TwinGene  |  -.1012587   .0561632    -1.80   0.072    -.2113889    .0088714
             |
       _cons |   .1399702   .0560563     2.50   0.013     .0300496    .2498907
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3066603   .0150343    20.40   0.000     .2771795     .336141
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2696.9301
Iteration 2:   log pseudolikelihood = -2696.9261
Refining estimates:
Iteration 0:   log pseudolikelihood = -2696.9261

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(2)  =   6.00
Log pseudolikelihood = -2696.9261                       Prob > chi2   = 0.0499

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8944408     .04159    -2.40   0.016       .81653    .9797855
        educ |   .9292705   .0907059    -0.75   0.452     .7674615    1.125195
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1115566   .0464983    -2.40   0.016    -.2026916   -.0204216
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2698.4095
Iteration 2:   log pseudolikelihood = -2698.4094
Refining estimates:
Iteration 0:   log pseudolikelihood = -2698.4094

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(3)  =   2.93
Log pseudolikelihood = -2698.4094                       Prob > chi2   = 0.4032

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .9208414   .0463928    -1.64   0.102     .8342583     1.01641
        educ |   .9471323   .0920987    -0.56   0.576      .782781    1.145991
     fasting |   .9740178    .301822    -0.08   0.932     .5306429    1.787852
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0824675   .0503809    -1.64   0.102    -.1812122    .0162772
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2696.5012
Iteration 2:   log pseudolikelihood =  -2696.498
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2696.498

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(4)  =   6.77
Log pseudolikelihood = -2696.498                        Prob > chi2   = 0.1483

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9080746   .0439935    -1.99   0.047     .8258161    .9985268
     z_crp_l |   .9529652   .0498818    -0.92   0.357     .8600465    1.055923
        educ |   .9265427   .0904687    -0.78   0.435     .7651616    1.121961
     fasting |   .9822124   .3015489    -0.06   0.953     .5381189    1.792803
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0964287    .048447    -1.99   0.047    -.1913831   -.0014742
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0481769   .0523438    -0.92   0.357    -.1507688    .0544151
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,900
                                                F(6, 2821)        =      27.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0528
                                                Root MSE          =     .94852

                             (Std. err. adjusted for 2,822 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0611894   .0141016    -4.34   0.000    -.0888399    -.033539
        educ |   .0347702   .0332165     1.05   0.295    -.0303608    .0999012
     fasting |    .053396   .1055981     0.51   0.613    -.1536612    .2604533
             |
     study_n |
     OCTOtw  |   .1350352    .102527     1.32   0.188    -.0660004    .3360707
      SATSA  |  -.2240841   .1184564    -1.89   0.059    -.4563541    .0081859
   TwinGene  |  -.5408202   .0676974    -7.99   0.000    -.6735617   -.4080787
             |
       _cons |   .6690791   .0675038     9.91   0.000     .5367173    .8014409
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0611894   .0141016    -4.34   0.000    -.0888399    -.033539
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -3419.922
Iteration 1:   log pseudolikelihood = -3416.0507
Iteration 2:   log pseudolikelihood = -3416.0465
Refining estimates:
Iteration 0:   log pseudolikelihood = -3416.0465

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,900                           Number of obs =  3,900
No. of failures =         575
Time at risk    = 36,218.3532
                                                        Wald chi2(2)  =   7.82
Log pseudolikelihood = -3416.0465                       Prob > chi2   = 0.0201

                             (Std. err. adjusted for 2,822 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9002423   .0368735    -2.57   0.010     .8307963    .9754933
        educ |   .8900903   .0757281    -1.37   0.171     .7533809    1.051607
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1050913   .0409596    -2.57   0.010    -.1853706    -.024812
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -3419.922
Iteration 1:   log pseudolikelihood =  -3419.299
Iteration 2:   log pseudolikelihood =  -3419.299
Refining estimates:
Iteration 0:   log pseudolikelihood =  -3419.299

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,900                           Number of obs =  3,900
No. of failures =         575
Time at risk    = 36,218.3532
                                                        Wald chi2(3)  =   1.29
Log pseudolikelihood = -3419.299                        Prob > chi2   = 0.7311

                             (Std. err. adjusted for 2,822 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   1.008846   .0410206     0.22   0.829      .931567    1.092535
        educ |   .9139136   .0772711    -1.06   0.287     .7743483    1.078634
     fasting |   1.056784   .1876949     0.31   0.756     .7461127    1.496813
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0088068   .0406609     0.22   0.829    -.0708872    .0885008
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -3419.922
Iteration 1:   log pseudolikelihood = -3416.0114
Iteration 2:   log pseudolikelihood = -3416.0072
Iteration 3:   log pseudolikelihood = -3416.0072
Refining estimates:
Iteration 0:   log pseudolikelihood = -3416.0072

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,900                           Number of obs =  3,900
No. of failures =         575
Time at risk    = 36,218.3532
                                                        Wald chi2(4)  =   7.84
Log pseudolikelihood = -3416.0072                       Prob > chi2   = 0.0978

                             (Std. err. adjusted for 2,822 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9004216   .0368763    -2.56   0.010       .83097    .9756778
        z_tc |   1.001782    .040768     0.04   0.965     .9249817    1.084959
        educ |   .8905004    .075626    -1.37   0.172     .7539553    1.051775
     fasting |   1.053602   .1856585     0.30   0.767     .7459054    1.488228
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1048922   .0409545    -2.56   0.010    -.1851616   -.0246228
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0017804   .0406955     0.04   0.965    -.0779813    .0815422
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,675
                                                F(6, 2616)        =      47.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0985
                                                Root MSE          =     .96295

                             (Std. err. adjusted for 2,617 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.2714869   .0172179   -15.77   0.000     -.305249   -.2377248
        educ |   .1311071   .0332262     3.95   0.000     .0659549    .1962594
     fasting |  -.0893744   .0932579    -0.96   0.338     -.272241    .0934923
             |
     study_n |
     OCTOtw  |   .2512314   .1278987     1.96   0.050     .0004385    .5020243
      SATSA  |   .1972357   .1396479     1.41   0.158    -.0765958    .4710671
   TwinGene  |   .0773562   .1073207     0.72   0.471    -.1330858    .2877982
             |
       _cons |   .1729264   .1087415     1.59   0.112    -.0403017    .3861545
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2714869   .0172179   -15.77   0.000     -.305249   -.2377248
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3065.9048
Iteration 1:   log pseudolikelihood = -3062.4549
Iteration 2:   log pseudolikelihood = -3062.4505
Refining estimates:
Iteration 0:   log pseudolikelihood = -3062.4505

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,675                           Number of obs =  3,675
No. of failures =         504
Time at risk    = 33,609.4477
                                                        Wald chi2(2)  =   6.94
Log pseudolikelihood = -3062.4505                       Prob > chi2   = 0.0311

                             (Std. err. adjusted for 2,617 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8971142   .0393403    -2.48   0.013     .8232293    .9776303
        educ |   .9011277   .0816297    -1.15   0.250     .7545347    1.076201
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1085721    .043852    -2.48   0.013    -.1945205   -.0226237
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3065.9048
Iteration 1:   log pseudolikelihood = -3065.4476
Iteration 2:   log pseudolikelihood = -3065.4476
Refining estimates:
Iteration 0:   log pseudolikelihood = -3065.4476

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,675                           Number of obs =  3,675
No. of failures =         504
Time at risk    = 33,609.4477
                                                        Wald chi2(3)  =   0.88
Log pseudolikelihood = -3065.4476                       Prob > chi2   = 0.8307

                             (Std. err. adjusted for 2,617 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   .9825269   .0462752    -0.37   0.708     .8958894    1.077543
        educ |   .9280547   .0835652    -0.83   0.407     .7779085    1.107181
     fasting |   .9643491   .1815878    -0.19   0.847     .6667335    1.394814
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0176276   .0470982    -0.37   0.708    -.1099383    .0746832
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3065.9048
Iteration 1:   log pseudolikelihood = -3061.8678
Iteration 2:   log pseudolikelihood = -3061.8622
Refining estimates:
Iteration 0:   log pseudolikelihood = -3061.8622

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,675                           Number of obs =  3,675
No. of failures =         504
Time at risk    = 33,609.4477
                                                        Wald chi2(4)  =   8.41
Log pseudolikelihood = -3061.8622                       Prob > chi2   = 0.0778

                             (Std. err. adjusted for 2,617 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8859321   .0397681    -2.70   0.007     .8113184    .9674078
       z_hdl |   .9521629   .0460596    -1.01   0.311     .8660351    1.046856
        educ |   .9071844   .0819773    -1.08   0.281     .7599362    1.082964
     fasting |   .9516808   .1771502    -0.27   0.790     .6607616    1.370685
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1211149   .0448885    -2.70   0.007    -.2090947   -.0331351
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0490192   .0483737    -1.01   0.311    -.1438299    .0457915
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,234
                                                F(5, 2350)        =       3.37
                                                Prob > F          =     0.0049
                                                R-squared         =     0.0052
                                                Root MSE          =      .9857

                             (Std. err. adjusted for 2,351 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0372957   .0160867    -2.32   0.021    -.0688413   -.0057501
        educ |   .0486828   .0376685     1.29   0.196    -.0251841    .1225497
     fasting |   .1625697   .1316248     1.24   0.217    -.0955431    .4206825
             |
     study_n |
      SATSA  |  -.2519817   .1977187    -1.27   0.203     -.639703    .1357396
   TwinGene  |   .0523027   .1543995     0.34   0.735    -.2504706     .355076
             |
       _cons |   .0760457   .1552749     0.49   0.624    -.2284443    .3805356
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0372957   .0160867    -2.32   0.021    -.0688413   -.0057501
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2394.5712
Iteration 1:   log pseudolikelihood = -2391.6994
Iteration 2:   log pseudolikelihood = -2391.6941
Refining estimates:
Iteration 0:   log pseudolikelihood = -2391.6941

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,234                           Number of obs =  3,234
No. of failures =         369
Time at risk    = 29,721.7248
                                                        Wald chi2(2)  =   5.66
Log pseudolikelihood = -2391.6941                       Prob > chi2   = 0.0589

                             (Std. err. adjusted for 2,351 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8864577   .0450804    -2.37   0.018     .8023624     .979367
        educ |   .9492651   .1016206    -0.49   0.627     .7695995    1.170874
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1205219   .0508545    -2.37   0.018    -.2201949   -.0208488
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2394.5712
Iteration 1:   log pseudolikelihood = -2394.2554
Iteration 2:   log pseudolikelihood = -2394.2554
Refining estimates:
Iteration 0:   log pseudolikelihood = -2394.2554

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,234                           Number of obs =  3,234
No. of failures =         369
Time at risk    = 29,721.7248
                                                        Wald chi2(3)  =   0.65
Log pseudolikelihood = -2394.2554                       Prob > chi2   = 0.8842

                             (Std. err. adjusted for 2,351 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.040779   .0544691     0.76   0.445      .939314    1.153204
        educ |   .9769521    .103671    -0.22   0.826     .7934992    1.202818
     fasting |   .9636625   .3055485    -0.12   0.907     .5176479    1.793971
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0399692    .052335     0.76   0.445    -.0626055    .1425439
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2394.5712
Iteration 1:   log pseudolikelihood = -2391.4627
Iteration 2:   log pseudolikelihood = -2391.4569
Refining estimates:
Iteration 0:   log pseudolikelihood = -2391.4569

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,234                           Number of obs =  3,234
No. of failures =         369
Time at risk    = 29,721.7248
                                                        Wald chi2(4)  =   6.22
Log pseudolikelihood = -2391.4569                       Prob > chi2   = 0.1832

                             (Std. err. adjusted for 2,351 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8873757   .0453277    -2.34   0.019     .8028375    .9808158
       z_ldl |   1.036515   .0542851     0.68   0.493     .9353968    1.148564
        educ |   .9478581   .1012673    -0.50   0.616      .768781    1.168649
     fasting |    .977723   .3043387    -0.07   0.942     .5312022    1.799583
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1194868   .0510806    -2.34   0.019     -.219603   -.0193706
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0358641   .0523727     0.68   0.493    -.0667845    .1385128
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,676
                                                F(5, 2666)        =      80.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1192
                                                Root MSE          =     .90637

                             (Std. err. adjusted for 2,667 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .2521481     .01544    16.33   0.000     .2218724    .2824238
        educ |  -.1146166   .0320817    -3.57   0.000    -.1775241   -.0517091
     fasting |   .0070741   .0915783     0.08   0.938    -.1724976    .1866457
             |
     study_n |
      SATSA  |  -.2685399   .1029539    -2.61   0.009    -.4704176   -.0666623
   TwinGene  |  -.5243281   .0656993    -7.98   0.000    -.6531548   -.3955013
             |
       _cons |   .5341767   .0656401     8.14   0.000      .405466    .6628875
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2521481     .01544    16.33   0.000     .2218724    .2824238
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3139.4235
Iteration 1:   log pseudolikelihood =  -3136.685
Iteration 2:   log pseudolikelihood = -3136.6821
Refining estimates:
Iteration 0:   log pseudolikelihood = -3136.6821

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,676                           Number of obs =  3,676
No. of failures =         514
Time at risk    = 34,749.8847
                                                        Wald chi2(2)  =   5.46
Log pseudolikelihood = -3136.6821                       Prob > chi2   = 0.0653

                             (Std. err. adjusted for 2,667 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9091174   .0392041    -2.21   0.027     .8354363    .9892968
        educ |   .9165668   .0823992    -0.97   0.333     .7684953    1.093168
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   -.095281   .0431233    -2.21   0.027    -.1798012   -.0107609
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3139.4235
Iteration 1:   log pseudolikelihood = -3139.1176
Iteration 2:   log pseudolikelihood = -3139.1176
Refining estimates:
Iteration 0:   log pseudolikelihood = -3139.1176

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,676                           Number of obs =  3,676
No. of failures =         514
Time at risk    = 34,749.8847
                                                        Wald chi2(3)  =   0.62
Log pseudolikelihood = -3139.1176                       Prob > chi2   = 0.8911

                             (Std. err. adjusted for 2,667 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |   .9965813    .047052    -0.07   0.942     .9084993    1.093203
        educ |   .9385272   .0842283    -0.71   0.480     .7871465    1.119021
     fasting |   1.063331   .1875975     0.35   0.728     .7524818    1.502593
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0034246   .0472134    -0.07   0.942    -.0959612     .089112
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3139.4235
Iteration 1:   log pseudolikelihood = -3136.4948
Iteration 2:   log pseudolikelihood = -3136.4916
Refining estimates:
Iteration 0:   log pseudolikelihood = -3136.4916

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,676                           Number of obs =  3,676
No. of failures =         514
Time at risk    = 34,749.8847
                                                        Wald chi2(4)  =   5.85
Log pseudolikelihood = -3136.4916                       Prob > chi2   = 0.2103

                             (Std. err. adjusted for 2,667 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |    .903568   .0399167    -2.30   0.022     .8286241    .9852902
      z_tg_l |   1.026267   .0494367     0.54   0.590     .9338061    1.127883
        educ |   .9199775   .0828504    -0.93   0.354     .7711176    1.097574
     fasting |   1.062499   .1861849     0.35   0.729     .7536503    1.497915
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1014039   .0441768    -2.30   0.022    -.1879887    -.014819
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0259278   .0481714     0.54   0.590    -.0684865     .120342
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,412
                                                F(5, 2539)        =      50.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0734
                                                Root MSE          =     .96097

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2478547   .0172024    14.41   0.000     .2141224     .281587
        educ |  -.1532338   .0350205    -4.38   0.000    -.2219055    -.084562
     fasting |   .0078438    .118545     0.07   0.947     -.224611    .2402985
             |
     study_n |
      SATSA  |  -.0308162   .1244008    -0.25   0.804    -.2747537    .2131212
   TwinGene  |  -.0875096   .0568589    -1.54   0.124    -.1990042    .0239849
             |
       _cons |   .1670941    .056251     2.97   0.003     .0567916    .2773966
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2478547   .0172024    14.41   0.000     .2141224     .281587
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2691.9977
Iteration 2:   log pseudolikelihood = -2691.9977
Refining estimates:
Iteration 0:   log pseudolikelihood = -2691.9977

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(2)  =   0.30
Log pseudolikelihood = -2691.9977                       Prob > chi2   = 0.8596

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9849069   .0522988    -0.29   0.775     .8875569    1.092935
        educ |   .9522012   .0932162    -0.50   0.617      .785959    1.153606
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0152082   .0531002    -0.29   0.775    -.1192827    .0888663
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2690.7601
Iteration 2:   log pseudolikelihood = -2690.7601
Refining estimates:
Iteration 0:   log pseudolikelihood = -2690.7601

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(3)  =   2.71
Log pseudolikelihood = -2690.7601                       Prob > chi2   = 0.4387

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .9240405   .0466092    -1.57   0.117     .8370587    1.020061
        educ |   .9441741   .0919535    -0.59   0.555     .7801053    1.142749
     fasting |    1.05897   .3361405     0.18   0.857     .5684515    1.972758
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0789994   .0504406    -1.57   0.117    -.1778611    .0198624
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2690.7601
Iteration 2:   log pseudolikelihood = -2690.7601
Refining estimates:
Iteration 0:   log pseudolikelihood = -2690.7601

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(4)  =   2.71
Log pseudolikelihood = -2690.7601                       Prob > chi2   = 0.6073

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.000038   .0542706     0.00   0.999      .899131    1.112269
     z_crp_l |   .9240338   .0474722    -1.54   0.124     .8355211    1.021923
        educ |   .9441788   .0924743    -0.59   0.558      .779267     1.14399
     fasting |   1.058961   .3368787     0.18   0.857     .5676677    1.975449
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0000379   .0542685     0.00   0.999    -.1063265    .1064023
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0790067   .0513749    -1.54   0.124    -.1796997    .0216863
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,828
                                                F(6, 2788)        =      25.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0491
                                                Root MSE          =     .94413

                             (Std. err. adjusted for 2,789 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0598062   .0157503    -3.80   0.000    -.0906896   -.0289228
        educ |    .050499   .0331676     1.52   0.128    -.0145365    .1155346
     fasting |   .0576957    .107542     0.54   0.592    -.1531744    .2685657
             |
     study_n |
     OCTOtw  |   .1607454   .1015149     1.58   0.113    -.0383066    .3597974
      SATSA  |  -.2867616   .1200083    -2.39   0.017    -.5220757   -.0514475
   TwinGene  |  -.5485963     .06817    -8.05   0.000     -.682265   -.4149275
             |
       _cons |   .6624502   .0678556     9.76   0.000     .5293979    .7955024
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0598062   .0157503    -3.80   0.000    -.0906896   -.0289228
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3294.0506
Iteration 1:   log pseudolikelihood = -3293.4337
Iteration 2:   log pseudolikelihood = -3293.4337
Refining estimates:
Iteration 0:   log pseudolikelihood = -3293.4337

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,828                           Number of obs =  3,828
No. of failures =         554
Time at risk    = 35,372.3567
                                                        Wald chi2(2)  =   1.19
Log pseudolikelihood = -3293.4337                       Prob > chi2   = 0.5527

                             (Std. err. adjusted for 2,789 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9722943   .0453797    -0.60   0.547     .8872985    1.065432
        educ |   .9196556   .0799943    -0.96   0.336     .7755062    1.090599
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0280968   .0466728    -0.60   0.547    -.1195738    .0633803
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3294.0506
Iteration 1:   log pseudolikelihood = -3293.6131
Iteration 2:   log pseudolikelihood = -3293.6131
Refining estimates:
Iteration 0:   log pseudolikelihood = -3293.6131

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,828                           Number of obs =  3,828
No. of failures =         554
Time at risk    = 35,372.3567
                                                        Wald chi2(3)  =   0.87
Log pseudolikelihood = -3293.6131                       Prob > chi2   = 0.8335

                             (Std. err. adjusted for 2,789 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   .9959682   .0418004    -0.10   0.923       .91732     1.08136
        educ |   .9239593   .0798586    -0.92   0.360     .7799787    1.094518
     fasting |   1.034889   .2067694     0.17   0.864     .6995595    1.530955
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0040399   .0419696    -0.10   0.923    -.0862989    .0782191
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3294.0506
Iteration 1:   log pseudolikelihood =  -3293.403
Iteration 2:   log pseudolikelihood =  -3293.403
Refining estimates:
Iteration 0:   log pseudolikelihood =  -3293.403

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,828                           Number of obs =  3,828
No. of failures =         554
Time at risk    = 35,372.3567
                                                        Wald chi2(4)  =   1.22
Log pseudolikelihood = -3293.403                        Prob > chi2   = 0.8748

                             (Std. err. adjusted for 2,789 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9712953   .0456441    -0.62   0.535     .8858308    1.065005
        z_tc |   .9942891   .0417668    -0.14   0.892     .9157069    1.079615
        educ |   .9201328   .0799082    -0.96   0.338     .7761195    1.090869
     fasting |   1.044944   .2095439     0.22   0.826     .7053436    1.548052
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0291247    .046993    -0.62   0.535    -.1212293    .0629799
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0057273   .0420067    -0.14   0.892     -.088059    .0766045
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,606
                                                F(6, 2583)        =      47.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0827
                                                Root MSE          =     .97162

                             (Std. err. adjusted for 2,584 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.2674045   .0174873   -15.29   0.000    -.3016951   -.2331139
        educ |   .1562925   .0341302     4.58   0.000     .0893671    .2232178
     fasting |   .0067935   .0982467     0.07   0.945    -.1858568    .1994438
             |
     study_n |
     OCTOtw  |   .3888016   .1320062     2.95   0.003     .1299529    .6476503
      SATSA  |   .2107716   .1456105     1.45   0.148    -.0747536    .4962967
   TwinGene  |   .0504046   .1125987     0.45   0.654    -.1703883    .2711975
             |
       _cons |   .1656811   .1141241     1.45   0.147    -.0581028    .3894651
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2674045   .0174873   -15.29   0.000    -.3016951   -.2331139
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2947.3656
Iteration 1:   log pseudolikelihood = -2946.7505
Iteration 2:   log pseudolikelihood = -2946.7505
Refining estimates:
Iteration 0:   log pseudolikelihood = -2946.7505

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,606                           Number of obs =  3,606
No. of failures =         484
Time at risk    = 32,776.3788
                                                        Wald chi2(2)  =   1.14
Log pseudolikelihood = -2946.7505                       Prob > chi2   = 0.5667

                             (Std. err. adjusted for 2,584 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9589751   .0470575    -0.85   0.393     .8710406    1.055787
        educ |   .9362373   .0868784    -0.71   0.478      .780546    1.122984
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0418901   .0490706    -0.85   0.393    -.1380667    .0542864
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2947.3656
Iteration 1:   log pseudolikelihood = -2947.0925
Iteration 2:   log pseudolikelihood = -2947.0925
Refining estimates:
Iteration 0:   log pseudolikelihood = -2947.0925

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,606                           Number of obs =  3,606
No. of failures =         484
Time at risk    = 32,776.3788
                                                        Wald chi2(3)  =   0.54
Log pseudolikelihood = -2947.0925                       Prob > chi2   = 0.9089

                             (Std. err. adjusted for 2,584 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   .9893994    .047417    -0.22   0.824     .9006951     1.08684
        educ |    .943191   .0871339    -0.63   0.527     .7869804    1.130408
     fasting |   .9418364    .201735    -0.28   0.780     .6189475    1.433168
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0106572    .047925    -0.22   0.824    -.1045885    .0832742
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2947.3656
Iteration 1:   log pseudolikelihood = -2946.6257
Iteration 2:   log pseudolikelihood = -2946.6256
Refining estimates:
Iteration 0:   log pseudolikelihood = -2946.6256

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,606                           Number of obs =  3,606
No. of failures =         484
Time at risk    = 32,776.3788
                                                        Wald chi2(4)  =   1.42
Log pseudolikelihood = -2946.6256                       Prob > chi2   = 0.8406

                             (Std. err. adjusted for 2,584 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9546299   .0475832    -0.93   0.352     .8657793    1.052599
       z_hdl |    .978928   .0476397    -0.44   0.662     .8898707    1.076898
        educ |   .9395785   .0870303    -0.67   0.501     .7835901    1.126619
     fasting |   .9545174   .2046061    -0.22   0.828     .6270816    1.452927
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0464315   .0498446    -0.93   0.352    -.1441252    .0512622
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0212972   .0486651    -0.44   0.662    -.1166791    .0740848
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,213
                                                F(5, 2341)        =       3.96
                                                Prob > F          =     0.0014
                                                R-squared         =     0.0063
                                                Root MSE          =      .9859

                             (Std. err. adjusted for 2,342 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0538989   .0174573    -3.09   0.002    -.0881323   -.0196655
        educ |   .0508155    .037453     1.36   0.175    -.0226291    .1242601
     fasting |   .1542951   .1355116     1.14   0.255    -.1114402    .4200304
             |
     study_n |
      SATSA  |  -.2375207    .198905    -1.19   0.233     -.627569    .1525277
   TwinGene  |   .0479903   .1535417     0.31   0.755    -.2531015    .3490821
             |
       _cons |   .0746244   .1544139     0.48   0.629    -.2281778    .3774267
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0538989   .0174573    -3.09   0.002    -.0881323   -.0196655
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2386.8334
Iteration 1:   log pseudolikelihood = -2386.5768
Iteration 2:   log pseudolikelihood = -2386.5768
Refining estimates:
Iteration 0:   log pseudolikelihood = -2386.5768

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,213                           Number of obs =  3,213
No. of failures =         368
Time at risk    = 29,530.2177
                                                        Wald chi2(2)  =   0.44
Log pseudolikelihood = -2386.5768                       Prob > chi2   = 0.8018

                             (Std. err. adjusted for 2,342 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9651745   .0546584    -0.63   0.531     .8637773    1.078474
        educ |   .9700507    .103796    -0.28   0.776     .7865302    1.196392
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0354464   .0566306    -0.63   0.531    -.1464403    .0755474
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2386.8334
Iteration 1:   log pseudolikelihood = -2386.5442
Iteration 2:   log pseudolikelihood = -2386.5442
Refining estimates:
Iteration 0:   log pseudolikelihood = -2386.5442

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,213                           Number of obs =  3,213
No. of failures =         368
Time at risk    = 29,530.2177
                                                        Wald chi2(3)  =   0.62
Log pseudolikelihood = -2386.5442                       Prob > chi2   = 0.8914

                             (Std. err. adjusted for 2,342 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.037054    .054417     0.69   0.488     .9357002    1.149387
        educ |    .972367    .103412    -0.26   0.792     .7894129    1.197723
     fasting |   1.053637   .3420268     0.16   0.872     .5576708    1.990692
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0363844   .0524726     0.69   0.488    -.0664601    .1392289
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2386.8334
Iteration 1:   log pseudolikelihood = -2386.3407
Iteration 2:   log pseudolikelihood = -2386.3406
Refining estimates:
Iteration 0:   log pseudolikelihood = -2386.3406

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,213                           Number of obs =  3,213
No. of failures =         368
Time at risk    = 29,530.2177
                                                        Wald chi2(4)  =   0.97
Log pseudolikelihood = -2386.3406                       Prob > chi2   = 0.9137

                             (Std. err. adjusted for 2,342 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9668754   .0553093    -0.59   0.556     .8643273     1.08159
       z_ldl |   1.034807   .0545764     0.65   0.517     .9331821    1.147499
        educ |    .968295   .1034156    -0.30   0.763     .7854126    1.193761
     fasting |   1.063239   .3442037     0.19   0.850     .5637289    2.005356
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0336856   .0572042    -0.59   0.556    -.1458038    .0784325
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0342149   .0527406     0.65   0.517    -.0691549    .1375846
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,604
                                                F(5, 2635)        =      94.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1264
                                                Root MSE          =     .90413

                             (Std. err. adjusted for 2,636 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2934778    .016058    18.28   0.000     .2619902    .3249654
        educ |  -.1248547   .0320561    -3.89   0.000    -.1877124    -.061997
     fasting |  -.0980218   .0934913    -1.05   0.295    -.2813456    .0853019
             |
     study_n |
      SATSA  |  -.2924019    .103037    -2.84   0.005    -.4944436   -.0903603
   TwinGene  |  -.4843473   .0661823    -7.32   0.000    -.6141219   -.3545727
             |
       _cons |   .5210452   .0665447     7.83   0.000     .3905601    .6515303
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2934778    .016058    18.28   0.000     .2619902    .3249654
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3013.3067
Iteration 1:   log pseudolikelihood = -3013.1194
Iteration 2:   log pseudolikelihood = -3013.1194
Refining estimates:
Iteration 0:   log pseudolikelihood = -3013.1194

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,604                           Number of obs =  3,604
No. of failures =         493
Time at risk    = 33,904.0969
                                                        Wald chi2(2)  =   0.36
Log pseudolikelihood = -3013.1194                       Prob > chi2   = 0.8352

                             (Std. err. adjusted for 2,636 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9873817   .0486128    -0.26   0.796     .8965551     1.08741
        educ |   .9487687   .0876761    -0.57   0.569     .7915903    1.137157
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0126986    .049234    -0.26   0.796    -.1091956    .0837983
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3013.3067
Iteration 1:   log pseudolikelihood = -3013.0971
Iteration 2:   log pseudolikelihood = -3013.0971
Refining estimates:
Iteration 0:   log pseudolikelihood = -3013.0971

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,604                           Number of obs =  3,604
No. of failures =         493
Time at risk    = 33,904.0969
                                                        Wald chi2(3)  =   0.41
Log pseudolikelihood = -3013.0971                       Prob > chi2   = 0.9373

                             (Std. err. adjusted for 2,636 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |   .9866955   .0475168    -0.28   0.781     .8978245    1.084363
        educ |   .9488426    .087337    -0.57   0.568     .7922179    1.136433
     fasting |   1.040982    .206203     0.20   0.839     .7060461    1.534806
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0133938   .0481575    -0.28   0.781    -.1077807    .0809931
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -3013.3067
Iteration 1:   log pseudolikelihood = -3013.0728
Iteration 2:   log pseudolikelihood = -3013.0728
Refining estimates:
Iteration 0:   log pseudolikelihood = -3013.0728

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,604                           Number of obs =  3,604
No. of failures =         493
Time at risk    = 33,904.0969
                                                        Wald chi2(4)  =   0.44
Log pseudolikelihood = -3013.0728                       Prob > chi2   = 0.9788

                             (Std. err. adjusted for 2,636 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9893276   .0506366    -0.21   0.834     .8948974    1.093722
      z_tg_l |   .9896106   .0491355    -0.21   0.833     .8978444    1.090756
        educ |   .9476171   .0876514    -0.58   0.561     .7904959    1.135968
     fasting |   1.045033   .2085616     0.22   0.825     .7067282    1.545283
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0107297   .0511828    -0.21   0.834    -.1110462    .0895867
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0104437   .0496513    -0.21   0.833    -.1077585    .0868711
------------------------------------------------------------------------------

. 
. /// Adding CRP without fasting adjustment..
> regress z_crp_l z_bmi educ i.study_n if(sex==2), vce(cluster pairid)

Linear regression                               Number of obs     =      3,433
                                                F(4, 2548)        =     117.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1250
                                                Root MSE          =     .93473

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .3066194   .0150354    20.39   0.000     .2771366    .3361021
        educ |  -.1095903   .0343953    -3.19   0.001    -.1770358   -.0421448
             |
     study_n |
      SATSA  |   .0019334   .0815521     0.02   0.981    -.1579818    .1618486
   TwinGene  |  -.1004231   .0561529    -1.79   0.074    -.2105331     .009687
             |
       _cons |   .1400541   .0560491     2.50   0.013     .0301478    .2499604
------------------------------------------------------------------------------

. regress z_crp_l z_whr educ i.study_n if(sex==2), vce(cluster pairid)

Linear regression                               Number of obs     =      3,412
                                                F(4, 2539)        =      63.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0734
                                                Root MSE          =     .96083

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2478852   .0171799    14.43   0.000     .2141972    .2815733
        educ |  -.1532404   .0350172    -4.38   0.000    -.2219056   -.0845752
             |
     study_n |
      SATSA  |  -.0245677   .0797237    -0.31   0.758    -.1808978    .1317625
   TwinGene  |   -.087411   .0568383    -1.54   0.124    -.1988652    .0240431
             |
       _cons |   .1670907   .0562424     2.97   0.003     .0568051    .2773764
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>      z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .3066194   .0150354    20.39   0.000     .2771366    .336102
> 1
>        z_whr |   .2478852   .0171799    14.43   0.000     .2141972    .281573
> 3
> -----------------------------------------------------------------------------
> -*/
.            
. stcox z_bmi educ if(z_crp_l!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2696.9301
Iteration 2:   log pseudolikelihood = -2696.9261
Refining estimates:
Iteration 0:   log pseudolikelihood = -2696.9261

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(2)  =   6.00
Log pseudolikelihood = -2696.9261                       Prob > chi2   = 0.0499

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .8944408     .04159    -2.40   0.016       .81653    .9797855
        educ |   .9292705   .0907059    -0.75   0.452     .7674615    1.125195
------------------------------------------------------------------------------

. stcox z_whr educ if(z_crp_l!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2691.9977
Iteration 2:   log pseudolikelihood = -2691.9977
Refining estimates:
Iteration 0:   log pseudolikelihood = -2691.9977

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(2)  =   0.30
Log pseudolikelihood = -2691.9977                       Prob > chi2   = 0.8596

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .9849069   .0522988    -0.29   0.775     .8875569    1.092935
        educ |   .9522012   .0932162    -0.50   0.617      .785959    1.153606
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .8944408     .04159    -2.40   0.016       .81653    .979785
> 5
>        z_whr |   .9849069   .0522988    -0.29   0.775     .8875569    1.09293
> 5
> -----------------------------------------------------------------------------
> -*/
.            
. stcox z_crp_l educ if(z_bmi!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2698.4129
Iteration 2:   log pseudolikelihood = -2698.4128
Refining estimates:
Iteration 0:   log pseudolikelihood = -2698.4128

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(2)  =   2.89
Log pseudolikelihood = -2698.4128                       Prob > chi2   = 0.2355

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .9207776   .0463469    -1.64   0.101     .8342762    1.016248
        educ |   .9472126   .0921535    -0.56   0.577     .7827712    1.146199
------------------------------------------------------------------------------

. stcox z_crp_l educ if(z_whr!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2690.7755
Iteration 2:   log pseudolikelihood = -2690.7755
Refining estimates:
Iteration 0:   log pseudolikelihood = -2690.7755

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(2)  =   2.70
Log pseudolikelihood = -2690.7755                       Prob > chi2   = 0.2599

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .9241309   .0465996    -1.56   0.118     .8371656     1.02013
        educ |   .9441264   .0919642    -0.59   0.555      .780041    1.142728
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>      z_crp_l |   .9207776   .0463469    -1.64   0.101     .8342762    1.01624
> 8
>      z_crp_l |   .9241309   .0465996    -1.56   0.118     .8371656     1.0201
> 3
> -----------------------------------------------------------------------------
> -*/
. 
. stcox z_bmi z_crp_l educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2699.8972
Iteration 1:   log pseudolikelihood = -2696.5028
Iteration 2:   log pseudolikelihood = -2696.4996
Refining estimates:
Iteration 0:   log pseudolikelihood = -2696.4996

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,433                           Number of obs =  3,433
No. of failures =         432
Time at risk    = 32,059.1684
                                                        Wald chi2(3)  =   6.69
Log pseudolikelihood = -2696.4996                       Prob > chi2   = 0.0824

                             (Std. err. adjusted for 2,549 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .9080419    .043952    -1.99   0.046     .8258575    .9984049
     z_crp_l |   .9529305   .0498592    -0.92   0.357     .8600519    1.055839
        educ |   .9266063   .0905272    -0.78   0.435     .7651294    1.122162
------------------------------------------------------------------------------

. stcox z_whr z_crp_l educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -2692.1571
Iteration 1:   log pseudolikelihood = -2690.7754
Iteration 2:   log pseudolikelihood = -2690.7754
Refining estimates:
Iteration 0:   log pseudolikelihood = -2690.7754

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,412                           Number of obs =  3,412
No. of failures =         431
Time at risk    = 31,867.6612
                                                        Wald chi2(3)  =   2.70
Log pseudolikelihood = -2690.7754                       Prob > chi2   = 0.4407

                             (Std. err. adjusted for 2,540 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |    1.00035    .054153     0.01   0.995     .8996487    1.112323
     z_crp_l |   .9240684   .0474736    -1.54   0.124     .8355531    1.021961
        educ |   .9441704   .0924864    -0.59   0.558     .7792391     1.14401
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> ---
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   .9080419    .043952    -1.99   0.046     .8258575    .998404
> 9
>      z_crp_l |   .9529305   .0498592    -0.92   0.357     .8600519    1.05583
> 9
>        z_whr |    1.00035    .054153     0.01   0.995     .8996487    1.11232
> 3
>      z_crp_l |   .9240684   .0474736    -1.54   0.124     .8355531    1.02196
> 1
> -----------------------------------------------------------------------------
> -*/
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    ///// SAVING THE LOG/OUTPUT /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. log close
      name:  <unnamed>
       log:  Z:\Temp\Aim2_GitHub\Individual-level analyses\Output\session.smcl
  log type:  smcl
 closed on:  30 Nov 2021, 16:36:15
-------------------------------------------------------------------------------
