-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  Z:\Temp\Aim2_GitHub\Individual-level analyses\Output\session.smcl
  log type:  smcl
 opened on:  30 Nov 2021, 16:31:55

. set more off

. 
. use "P:\Dementia_IK\FORTE_postdoc\Aim_2\Data\Derived_data\BMI_dem_mediation_2
> 0210707_mid.dta", clear

. rename *, lower

. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    // DATA MANAGEMENT //
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. /// NOTE! Removing any non-essential code, as everything is set up as in main
>  analyses
> 
. // Setting BMI below 15 or above 55 as missing
. replace bmi=. if bmi < 15
(0 real changes made)

. replace bmi=. if bmi > 55
(2 real changes made, 2 to missing)

. replace whr=. if whr > 1.35
(3 real changes made, 3 to missing)

. drop if bmi==. & whr==.
(0 observations deleted)

. 
. // drop those with no mediator measures
. drop if crp==. & tc==. & hdl==. & ldl==. & tg==.
(18 observations deleted)

. 
. gen tc_dup=tc
(1 missing value generated)

. replace tc=. if tg>tc_dup & tg!=.
(24 real changes made, 24 to missing)

. replace hdl=. if tg>tc_dup & tg!=.
(24 real changes made, 24 to missing)

. replace ldl=. if tg>tc_dup & tg!=.
(2 real changes made, 2 to missing)

. replace tg=. if tg>tc_dup & tg!=.
(24 real changes made, 24 to missing)

. drop tc_dup

. 
. // Setting CRP >100 to missing, as it indicates bacterial infection
. replace crp=. if crp > 100
(4 real changes made, 4 to missing)

. gen crp_l = log(crp)
(602 missing values generated)

. 
. // And logged TG
. gen tg_l = log(tg)
(25 missing values generated)

. replace tg_l=. if tg_l<-2
(1 real change made, 1 to missing)

. 
. /// Standardizing variables for analyses
> foreach y of varlist bmi tc hdl ldl crp_l tg_l   {
  2.         egen z_`y' = std(`y')
  3.         }
(2 missing values generated)
(25 missing values generated)
(66 missing values generated)
(470 missing values generated)
(602 missing values generated)
(26 missing values generated)

. 
. /// WHR is standardized by sex
> egen whr_sexm= mean(whr), by(sex)

. egen whr_sexsd= sd(whr), by(sex)

. gen z_whr= (whr-whr_sexm)/whr_sexsd
(196 missing values generated)

.         
. // study as numeric
. // NOTE! Only TG and SATSA, so generating binary
. gen study_n=0

. replace study_n=1 if study_main=="TwinGene"
(5,558 real changes made)

. 
. // sex as binary
. gen bsex=sex-1

. 
. // recode fasting to binary (and assign missing as fasting..)
. recode fasting 2=0
(5705 changes made to fasting)

. recode fasting .=0
(0 changes made to fasting)

. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                 ///// SETTING
>  UP THE SURVIVAL DATA /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Generate age at end of follow-up
. gen age_exit=min(lastage, dem_onset)

. list lastage dem_onset age_exit in 1/20

     +-------------------------------+
     | lastage   dem_on~t   age_exit |
     |-------------------------------|
  1. |      89          .         89 |
  2. |      75          .         75 |
  3. |      89          .         89 |
  4. |      90          .         90 |
  5. |      76          .         76 |
     |-------------------------------|
  6. |      74          .         74 |
  7. |      87          .         87 |
  8. |      83          .         83 |
  9. |      85         77         77 |
 10. |      82          .         82 |
     |-------------------------------|
 11. |      89          .         89 |
 12. |      90          .         90 |
 13. |      74          .         74 |
 14. |      95          .         95 |
 15. |      95          .         95 |
     |-------------------------------|
 16. |      74          .         74 |
 17. |      88          .         88 |
 18. |      80          .         80 |
 19. |      66          .         66 |
 20. |      94          .         94 |
     +-------------------------------+

. // Drop individuals who were already demented or has no registry info at base
> line
. drop if age >= age_exit
(13 observations deleted)

. // 13 deleted
. 
. // Check remaining nr of cases
. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,889       98.17       98.17
          1 |        110        1.83      100.00
------------+-----------------------------------
      Total |      5,999      100.00

. // 110 dementia cases remaining, 5889 ctrls
. 
. stset age_exit, failure(dementia==1) id(twinnr) enter(age)

Survival-time data settings

           ID variable: twinnr
         Failure event: dementia==1
Observed time interval: (age_exit[_n-1], age_exit]
     Enter on or after: time age
     Exit on or before: failure

--------------------------------------------------------------------------
      5,999  total observations
          0  exclusions
--------------------------------------------------------------------------
      5,999  observations remaining, representing
      5,999  subjects
        110  failures in single-failure-per-subject data
 58,768.983  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =  45.16393
                                          Last observed exit t =        95

. 
. list twinnr age dem_onset age_exit _st _t0 _t _d dementia in 1/20, noobs

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21801 | 61.77739426 |        . |       89 |   1 | 61.777394 | 89 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  21802 | 61.77739426 |        . |       75 |   1 | 61.777394 | 75 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24041 | 60.39907955 |        . |       89 |   1 |  60.39908 | 89 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24042 | 60.40181898 |        . |       90 |   1 | 60.401819 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24261 | 61.34976989 |        . |       76 |   1 |  61.34977 | 76 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24262 | 61.00273943 |        . |       74 |   1 | 61.002739 | 74 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24881 | 59.99178172 |        . |       87 |   1 | 59.991782 | 87 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  24882 | 59.99452115 |        . |       83 |   1 | 59.994521 | 83 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  29031 | 60.65570896 |       77 |       77 |   1 | 60.655709 | 77 |  1 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       1                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  29032 |  61.7977208 |        . |       82 |   1 | 61.797721 | 82 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  29611 | 59.76917598 |        . |       89 |   1 | 59.769176 | 89 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  |  29612 | 59.76917598 |        . |       90 |   1 | 59.769176 | 90 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 170572 | 64.99726057 |        . |       74 |   1 | 64.997261 | 74 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 173111 | 64.65181898 |        . |       95 |   1 | 64.651819 | 95 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 173112 | 64.65181898 |        . |       95 |   1 | 64.651819 | 95 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 174201 | 64.44406092 |        . |       74 |   1 | 64.444061 | 74 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 174202 | 64.44406092 |        . |       88 |   1 | 64.444061 | 88 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 175621 | 64.10798817 |        . |       80 |   1 | 64.107988 | 80 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 175622 | 64.09155161 |        . |       66 |   1 | 64.091552 | 66 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

  +------------------------------------------------------------------------+
  | twinnr |         age | dem_on~t | age_exit | _st |       _t0 | _t | _d |
  | 176422 | 63.94406092 |        . |       94 |   1 | 63.944061 | 94 |  0 |
  |------------------------------------------------------------------------|
  |                                dementia                                |
  |                                       0                                |
  +------------------------------------------------------------------------+

. stdes

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

                                   |-------------- Per subject --------------|
Category                   Total        Mean         Min     Median        Max
------------------------------------------------------------------------------
Number of subjects          5999   
Number of records           5999           1           1          1          1

Entry time (first)                  59.08802    45.16393         60   64.99726
Exit time (final)                   68.88448          60         69         95

Subjects with gap              0   
Time on gap                    0           .           .          .          .
Time at risk           58768.983    9.796463    .5805939          9    30.9863

Failures                     110    .0183364           0          0          1
------------------------------------------------------------------------------

. 
. drop if _st!=1
(0 observations deleted)

. // n=0
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    /////  SURVIVAL MODELS, MEN /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Base model of BMI and WHR, full sample
. stcox z_bmi educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.46474
Iteration 1:   log pseudolikelihood = -234.81894
Iteration 2:   log pseudolikelihood = -234.81734
Iteration 3:   log pseudolikelihood = -234.81734
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.81734

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      2,646                            Number of obs =  2,646
No. of failures =         45
Time at risk    = 25,461.911
                                                        Wald chi2(2)  =   1.61
Log pseudolikelihood = -234.81734                       Prob > chi2   = 0.4471

                             (Std. err. adjusted for 2,005 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.217668   .1927734     1.24   0.214     .8928367    1.660679
        educ |   1.137381   .3163117     0.46   0.643     .6594506    1.961686
------------------------------------------------------------------------------

. stcox z_whr educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.69303
Iteration 1:   log pseudolikelihood = -195.21213
Iteration 2:   log pseudolikelihood = -195.20869
Iteration 3:   log pseudolikelihood = -195.20869
Refining estimates:
Iteration 0:   log pseudolikelihood = -195.20869

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,544                           Number of obs =  2,544
No. of failures =          39
Time at risk    = 23,908.8824
                                                        Wald chi2(2)  =   5.96
Log pseudolikelihood = -195.20869                       Prob > chi2   = 0.0509

                             (Std. err. adjusted for 1,950 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.496664   .2521531     2.39   0.017     1.075763    2.082246
        educ |   1.182862   .3657123     0.54   0.587     .6453022    2.168228
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   1.217668   .1927734     1.24   0.214     .8928367    1.66067
> 9
>        z_whr |   1.496664   .2521531     2.39   0.017     1.075763    2.08224
> 6
> -----------------------------------------------------------------------------
> -*/
. 
. 
. // BMI, adjusted for WHR, and vice versa 
. stcox z_bmi z_whr educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.69303
Iteration 1:   log pseudolikelihood = -195.19734
Iteration 2:   log pseudolikelihood = -195.19328
Iteration 3:   log pseudolikelihood = -195.19328
Refining estimates:
Iteration 0:   log pseudolikelihood = -195.19328

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,544                           Number of obs =  2,544
No. of failures =          39
Time at risk    = 23,908.8824
                                                        Wald chi2(3)  =   5.98
Log pseudolikelihood = -195.19328                       Prob > chi2   = 0.1127

                             (Std. err. adjusted for 1,950 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.036808   .1597869     0.23   0.815     .7665071    1.402429
       z_whr |   1.474113   .2519215     2.27   0.023     1.054539    2.060623
        educ |   1.186213   .3676279     0.55   0.582     .6461907    2.177533
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   1.036808   .1597869     0.23   0.815     .7665071    1.40242
> 9
>        z_whr |   1.474113   .2519215     2.27   0.023     1.054539    2.06062
> 3
> -----------------------------------------------------------------------------
> -*/
. 
. // Loop over models for BMI, WHR, and biomarkers
. foreach ad_measure in z_bmi z_whr {
  2. 
.         cap postclose coxreg_dem
  3.                 postfile coxreg_dem str20  (exp_var base_lin base_bmi base
> _biom adj_bmi adj_biom) ///
>                 using P:\Dementia_IK\FORTE_postdoc\Aim_2\Output\BMI_dem_media
> tion_20210824_mid_men_`ad_measure'.dta, replace
  4.         foreach exp_var in z_crp_l z_tc z_hdl z_ldl z_tg_l {
  5.                 set more off
  6.                 
.                 // BMI/WHR on the biomarker
.                 regress `exp_var' `ad_measure' educ fasting i.study_n if(sex=
> =1), vce(cluster pairid)
  7.                 lincom `ad_measure' 
  8.                         local m_lin = r(estimate)
  9.                         local se_lin = r(se)
 10.                         local Lci_lin = `m_lin'-1.96*`se_lin'
 11.                         local Uci_lin = `m_lin'+1.96*`se_lin'
 12.                         local base_lin= string(`m_lin',"%9.2f")+" ("+strin
> g(`Lci_lin',"%9.2f")+"-"+string(`Uci_lin',"%9.2f")+")"  
 13.                         
.                 // Base model
.                 stcox `ad_measure'  educ if(`exp_var'!=. & sex==1), vce(clust
> er pairid) strata(study_main)
 14.                 lincom `ad_measure' 
 15.                         local m_m0 = r(estimate)
 16.                         local se_m0 = r(se)
 17.                         local Lci_m0 = exp(`m_m0'-1.96*`se_m0')
 18.                         local Uci_m0 = exp(`m_m0'+1.96*`se_m0')
 19.                         local base_bmi= string(exp(`m_m0'),"%9.2f")+" ("+s
> tring(`Lci_m0',"%9.2f")+"-"+string(`Uci_m0',"%9.2f")+")"  
 20.                         
.                 // Base model, biomarker
.                 stcox `exp_var'  educ fasting  if(`ad_measure'!=. & sex==1), 
> vce(cluster pairid) strata(study_main)
 21.                 lincom `exp_var' 
 22.                         local m_m1 = r(estimate)
 23.                         local se_m1 = r(se)
 24.                         local Lci_m1 = exp(`m_m1'-1.96*`se_m1')
 25.                         local Uci_m1 = exp(`m_m1'+1.96*`se_m1')
 26.                         local base_biom= string(exp(`m_m1'),"%9.2f")+" ("+
> string(`Lci_m1',"%9.2f")+"-"+string(`Uci_m1',"%9.2f")+")"  
 27.                 
.                 // Adjusted for the biomarker
.                 stcox `ad_measure' `exp_var'  educ fasting if(sex==1), vce(cl
> uster pairid) strata(study_main)
 28.                 lincom `ad_measure' 
 29.                         local m_m2 = r(estimate)
 30.                         local se_m2 = r(se)
 31.                         local Lci_m2 = exp(`m_m2'-1.96*`se_m2')
 32.                         local Uci_m2 = exp(`m_m2'+1.96*`se_m2')
 33.                         local adj_bmi= string(exp(`m_m2'),"%9.2f")+" ("+st
> ring(`Lci_m2',"%9.2f")+"-"+string(`Uci_m2',"%9.2f")+")"  
 34.                 lincom `exp_var'
 35.                         local m_m3 = r(estimate)
 36.                         local se_m3 = r(se)
 37.                         local Lci_m3 = exp(`m_m3'-1.96*`se_m3')
 38.                         local Uci_m3 = exp(`m_m3'+1.96*`se_m3')
 39.                         local adj_biom= string(exp(`m_m3'),"%9.2f")+" ("+s
> tring(`Lci_m3',"%9.2f")+"-"+string(`Uci_m3',"%9.2f")+")"  
 40. 
.                 post coxreg_dem ("`exp_var'") ("`base_lin'") ("`base_bmi'") (
> "`base_biom'") ("`adj_bmi'") ("`adj_biom'") 
 41.         }
 42.         postclose coxreg_dem
 43. }         

Linear regression                               Number of obs     =      2,378
                                                F(4, 1857)        =      64.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0924
                                                Root MSE          =     .95425

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .3257487   .0215321    15.13   0.000     .2835191    .3679782
        educ |  -.0467256   .0467306    -1.00   0.317    -.1383756    .0449243
     fasting |    .016906   .1762213     0.10   0.924    -.3287067    .3625187
   1.study_n |  -.5374119   .1963531    -2.74   0.006    -.9225079   -.1523159
       _cons |   .4950146   .1977876     2.50   0.012     .1071053    .8829239
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3257487   .0215321    15.13   0.000     .2835191    .3679782
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood = -102.80887
Iteration 2:   log pseudolikelihood = -102.74392
Iteration 3:   log pseudolikelihood = -102.74348
Iteration 4:   log pseudolikelihood = -102.74348
Refining estimates:
Iteration 0:   log pseudolikelihood = -102.74348

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(2)  =   4.08
Log pseudolikelihood = -102.74348                       Prob > chi2   = 0.1299

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.238713    .213034     1.24   0.213      .884262    1.735244
        educ |   3.085518    2.31986     1.50   0.134     .7068847    13.46814
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .214073   .1719801     1.24   0.213    -.1230019    .5511479
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood = -103.57391
Iteration 2:   log pseudolikelihood = -102.39752
Iteration 3:   log pseudolikelihood = -102.29541
Iteration 4:   log pseudolikelihood = -102.29302
Iteration 5:   log pseudolikelihood = -102.29301
Refining estimates:
Iteration 0:   log pseudolikelihood = -102.29301

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(3)  =   3.42
Log pseudolikelihood = -102.29301                       Prob > chi2   = 0.3312

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   1.028924   .3003331     0.10   0.922     .5806649    1.823228
        educ |   3.247846   2.590186     1.48   0.140     .6803851    15.50373
     fasting |   4.870628   5.313068     1.45   0.147     .5741981    41.31504
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0285134   .2918906     0.10   0.922    -.5435815    .6006084
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood =  -103.2883
Iteration 2:   log pseudolikelihood =  -102.0986
Iteration 3:   log pseudolikelihood =  -101.9938
Iteration 4:   log pseudolikelihood = -101.99129
Iteration 5:   log pseudolikelihood = -101.99129
Refining estimates:
Iteration 0:   log pseudolikelihood = -101.99129

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(4)  =   6.13
Log pseudolikelihood = -101.99129                       Prob > chi2   = 0.1895

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.250551   .2897582     0.96   0.335      .794098    1.969375
     z_crp_l |   .9647814    .328775    -0.11   0.916     .4947198    1.881476
        educ |   3.325662   2.634708     1.52   0.129     .7039243    15.71195
     fasting |   4.784621    5.21987     1.43   0.151      .563915    40.59584
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .223584   .2317045     0.96   0.335    -.2305484    .6777164
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0358537   .3407767    -0.11   0.916    -.7037637    .6320563
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,626
                                                F(4, 1990)        =       8.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0155
                                                Root MSE          =     .96139

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0544076   .0216616    -2.51   0.012    -.0968894   -.0119259
        educ |   .0251039   .0463167     0.54   0.588    -.0657305    .1159383
     fasting |   .0966848   .1180529     0.82   0.413    -.1348354    .3282049
   1.study_n |  -.3643203   .1035825    -3.52   0.000    -.5674617   -.1611788
       _cons |    .121832   .1056595     1.15   0.249    -.0853829    .3290469
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0544076   .0216616    -2.51   0.012    -.0968894   -.0119259
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.38291
Iteration 1:   log pseudolikelihood = -234.72592
Iteration 2:   log pseudolikelihood = -234.72428
Iteration 3:   log pseudolikelihood = -234.72428
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.72428

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      2,626                            Number of obs =  2,626
No. of failures =         45
Time at risk    = 25,285.911
                                                        Wald chi2(2)  =   1.63
Log pseudolikelihood = -234.72428                       Prob > chi2   = 0.4420

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.220278   .1937311     1.25   0.210     .8939681    1.665694
        educ |   1.137944   .3166746     0.46   0.642     .6595429    1.963356
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1990784   .1587598     1.25   0.210    -.1120851     .510242
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.38291
Iteration 1:   log pseudolikelihood = -235.00688
Iteration 2:   log pseudolikelihood = -235.00653
Refining estimates:
Iteration 0:   log pseudolikelihood = -235.00653

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      2,626                            Number of obs =  2,626
No. of failures =         45
Time at risk    = 25,285.911
                                                        Wald chi2(3)  =   0.76
Log pseudolikelihood = -235.00653                       Prob > chi2   = 0.8579

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   1.132656   .1760426     0.80   0.423      .835219    1.536016
        educ |   1.097785    .304654     0.34   0.737     .6372274    1.891212
     fasting |   1.024522     .44812     0.06   0.956     .4347207    2.414526
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1245654   .1554246     0.80   0.423    -.1800613     .429192
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.38291
Iteration 1:   log pseudolikelihood = -234.46067
Iteration 2:   log pseudolikelihood = -234.45768
Iteration 3:   log pseudolikelihood = -234.45768
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.45768

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =      2,626                            Number of obs =  2,626
No. of failures =         45
Time at risk    = 25,285.911
                                                        Wald chi2(4)  =   1.97
Log pseudolikelihood = -234.45768                       Prob > chi2   = 0.7413

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.207039   .1929039     1.18   0.239     .8824412    1.651037
        z_tc |   1.113923   .1686946     0.71   0.476     .8278428    1.498866
        educ |   1.147454   .3253129     0.49   0.628     .6582825     2.00013
     fasting |   1.046664   .4619368     0.10   0.918     .4406934    2.485869
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1881702   .1598158     1.18   0.239    -.1250631    .5014034
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1078884   .1514418     0.71   0.476     -.188932    .4047089
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,612
                                                F(4, 1984)        =      79.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1162
                                                Root MSE          =      .7638

                             (Std. err. adjusted for 1,985 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.3031481    .017294   -17.53   0.000    -.3370644   -.2692319
        educ |   .0111868   .0376586     0.30   0.766    -.0626676    .0850413
     fasting |  -.0321453   .0958317    -0.34   0.737    -.2200866     .155796
   1.study_n |  -.1482196   .0820357    -1.81   0.071    -.3091048    .0126657
       _cons |    -.26778   .0855808    -3.13   0.002    -.4356176   -.0999424
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.3031481    .017294   -17.53   0.000    -.3370644   -.2692319
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -225.32752
Iteration 1:   log pseudolikelihood = -224.90518
Iteration 2:   log pseudolikelihood = -224.90442
Refining estimates:
Iteration 0:   log pseudolikelihood = -224.90442

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,612                           Number of obs =  2,612
No. of failures =          43
Time at risk    = 25,054.0459
                                                        Wald chi2(2)  =   1.06
Log pseudolikelihood = -224.90442                       Prob > chi2   = 0.5877

                             (Std. err. adjusted for 1,985 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.177966   .1898252     1.02   0.309     .8589433    1.615478
        educ |   1.094472   .3064459     0.32   0.747     .6322271    1.894682
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1637892   .1611466     1.02   0.309    -.1520524    .4796308
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -225.32752
Iteration 1:   log pseudolikelihood = -224.38158
Iteration 2:   log pseudolikelihood = -224.37345
Iteration 3:   log pseudolikelihood = -224.37345
Refining estimates:
Iteration 0:   log pseudolikelihood = -224.37345

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,612                           Number of obs =  2,612
No. of failures =          43
Time at risk    = 25,054.0459
                                                        Wald chi2(3)  =   1.78
Log pseudolikelihood = -224.37345                       Prob > chi2   = 0.6183

                             (Std. err. adjusted for 1,985 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   1.264304   .2243408     1.32   0.186     .8929204    1.790155
        educ |     1.0356   .2929142     0.12   0.902     .5948863     1.80281
     fasting |   .9195535   .4242829    -0.18   0.856     .3722475     2.27155
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2345222    .177442     1.32   0.186    -.1132578    .5823022
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -225.32752
Iteration 1:   log pseudolikelihood = -223.30125
Iteration 2:   log pseudolikelihood = -223.28995
Iteration 3:   log pseudolikelihood = -223.28995
Refining estimates:
Iteration 0:   log pseudolikelihood = -223.28995

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,612                           Number of obs =  2,612
No. of failures =          43
Time at risk    = 25,054.0459
                                                        Wald chi2(4)  =   5.77
Log pseudolikelihood = -223.28995                       Prob > chi2   = 0.2172

                             (Std. err. adjusted for 1,985 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.323169   .1975147     1.88   0.061     .9875366    1.772873
       z_hdl |   1.395106   .2538974     1.83   0.067     .9765527    1.993052
        educ |   1.094757   .3138698     0.32   0.752     .6241311    1.920257
     fasting |    .943999   .4405333    -0.12   0.902     .3782194     2.35613
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2800299    .149274     1.88   0.061    -.0125417    .5726015
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3329703   .1819915     1.83   0.067    -.0237265    .6896671
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,422
                                                F(4, 1882)        =       3.51
                                                Prob > F          =     0.0074
                                                R-squared         =     0.0057
                                                Root MSE          =     .98179

                             (Std. err. adjusted for 1,883 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   -.065727   .0224653    -2.93   0.003    -.1097866   -.0216674
        educ |   .0496881   .0506431     0.98   0.327    -.0496344    .1490106
     fasting |   .0179356   .1792989     0.10   0.920      -.33371    .3695812
   1.study_n |   .3303353   .2224312     1.49   0.138    -.1059023    .7665729
       _cons |  -.4334378   .2268635    -1.91   0.056    -.8783682    .0114926
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   -.065727   .0224653    -2.93   0.003    -.1097866   -.0216674
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -111.60094
Iteration 1:   log pseudolikelihood = -110.00489
Iteration 2:   log pseudolikelihood = -109.92763
Iteration 3:   log pseudolikelihood = -109.92697
Iteration 4:   log pseudolikelihood = -109.92697
Refining estimates:
Iteration 0:   log pseudolikelihood = -109.92697

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,422                           Number of obs =  2,422
No. of failures =          17
Time at risk    = 21,813.2649
                                                        Wald chi2(2)  =   3.42
Log pseudolikelihood = -109.92697                       Prob > chi2   = 0.1805

                             (Std. err. adjusted for 1,883 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.174257   .2268787     0.83   0.406     .8040855    1.714843
        educ |   3.206177   2.390826     1.56   0.118     .7434501    13.82685
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1606358   .1932104     0.83   0.406    -.2180497    .5393213
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -111.60094
Iteration 1:   log pseudolikelihood = -110.67176
Iteration 2:   log pseudolikelihood = -109.43027
Iteration 3:   log pseudolikelihood = -109.31586
Iteration 4:   log pseudolikelihood = -109.31287
Iteration 5:   log pseudolikelihood = -109.31287
Refining estimates:
Iteration 0:   log pseudolikelihood = -109.31287

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,422                           Number of obs =  2,422
No. of failures =          17
Time at risk    = 21,813.2649
                                                        Wald chi2(3)  =   4.16
Log pseudolikelihood = -109.31287                       Prob > chi2   = 0.2446

                             (Std. err. adjusted for 1,883 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.052388   .3282017     0.16   0.870     .5711064    1.939255
        educ |   3.366232   2.738841     1.49   0.136     .6832626    16.58442
     fasting |   5.176291   5.597791     1.52   0.128     .6215911    43.10549
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .051062   .3118638     0.16   0.870    -.5601797    .6623037
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -111.60094
Iteration 1:   log pseudolikelihood =  -110.5027
Iteration 2:   log pseudolikelihood = -109.25792
Iteration 3:   log pseudolikelihood = -109.14217
Iteration 4:   log pseudolikelihood = -109.13913
Iteration 5:   log pseudolikelihood = -109.13913
Refining estimates:
Iteration 0:   log pseudolikelihood = -109.13913

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,422                           Number of obs =  2,422
No. of failures =          17
Time at risk    = 21,813.2649
                                                        Wald chi2(4)  =   5.45
Log pseudolikelihood = -109.13913                       Prob > chi2   = 0.2440

                             (Std. err. adjusted for 1,883 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.173828   .2418379     0.78   0.437      .783855    1.757816
       z_ldl |     1.0623   .3339014     0.19   0.848     .5737172    1.966963
        educ |   3.445206   2.780634     1.53   0.125     .7082854      16.758
     fasting |   5.111912   5.535968     1.51   0.132     .6120276    42.69684
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1602703    .206025     0.78   0.437    -.2435313    .5640719
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0604361   .3143194     0.19   0.848    -.5556187    .6764908
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,625
                                                F(4, 1990)        =      78.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1281
                                                Root MSE          =     .97411

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .4005876   .0229857    17.43   0.000     .3555091     .445666
        educ |  -.0084382   .0460901    -0.18   0.855    -.0988282    .0819517
     fasting |   .2036867   .1241937     1.64   0.101    -.0398766      .44725
   1.study_n |  -.2225172   .0956767    -2.33   0.020    -.4101542   -.0348802
       _cons |   .3138164   .0981738     3.20   0.001     .1212822    .5063507
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4005876   .0229857    17.43   0.000     .3555091     .445666
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.07765
Iteration 1:   log pseudolikelihood = -234.34422
Iteration 2:   log pseudolikelihood = -234.34216
Iteration 3:   log pseudolikelihood = -234.34216
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.34216

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,625                           Number of obs =  2,625
No. of failures =          45
Time at risk    = 25,255.1895
                                                        Wald chi2(2)  =   1.84
Log pseudolikelihood = -234.34216                       Prob > chi2   = 0.3980

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.232697   .1943052     1.33   0.184     .9050754    1.678912
        educ |    1.15954   .3243589     0.53   0.597     .6701602    2.006287
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2092044   .1576261     1.33   0.184    -.0997371    .5181459
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.07765
Iteration 1:   log pseudolikelihood =  -234.3394
Iteration 2:   log pseudolikelihood = -234.33887
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.33887

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,625                           Number of obs =  2,625
No. of failures =          45
Time at risk    = 25,255.1895
                                                        Wald chi2(3)  =   1.44
Log pseudolikelihood = -234.33887                       Prob > chi2   = 0.6960

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |    1.18474   .1704713     1.18   0.239     .8936028    1.570731
        educ |   1.115532   .3094052     0.39   0.693     .6477266    1.921198
     fasting |   .9629835   .4148288    -0.09   0.930     .4139452    2.240241
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1695237   .1438892     1.18   0.239    -.1124939    .4515413
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -235.07765
Iteration 1:   log pseudolikelihood = -234.04511
Iteration 2:   log pseudolikelihood = -234.04351
Iteration 3:   log pseudolikelihood = -234.04351
Refining estimates:
Iteration 0:   log pseudolikelihood = -234.04351

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,625                           Number of obs =  2,625
No. of failures =          45
Time at risk    = 25,255.1895
                                                        Wald chi2(4)  =   2.07
Log pseudolikelihood = -234.04351                       Prob > chi2   = 0.7222

                             (Std. err. adjusted for 1,991 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |    1.16185   .1848773     0.94   0.346     .8505581    1.587069
      z_tg_l |   1.128669   .1643795     0.83   0.406     .8483935    1.501536
        educ |   1.155965   .3258497     0.51   0.607     .6652786    2.008566
     fasting |   .9830574   .4289368    -0.04   0.969     .4179984    2.311975
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1500133   .1591232     0.94   0.346    -.1618625    .4618891
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1210388   .1456402     0.83   0.406    -.1644107    .4064883
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,324
                                                F(4, 1825)        =      48.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0808
                                                Root MSE          =     .95722

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2741945   .0210627    13.02   0.000      .232885    .3155041
        educ |  -.0704449   .0481211    -1.46   0.143    -.1648232    .0239334
     fasting |   .0347923   .1725888     0.20   0.840       -.3037    .3732845
   1.study_n |  -.4892084   .2187663    -2.24   0.025    -.9182671   -.0601497
       _cons |    .525295   .2203142     2.38   0.017     .0932005    .9573895
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2741945   .0210627    13.02   0.000      .232885    .3155041
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -94.718326
Iteration 2:   log pseudolikelihood = -94.665983
Iteration 3:   log pseudolikelihood = -94.665755
Refining estimates:
Iteration 0:   log pseudolikelihood = -94.665755

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(2)  =   7.51
Log pseudolikelihood = -94.665755                       Prob > chi2   = 0.0234

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.508397   .2935985     2.11   0.035     1.029996    2.209001
        educ |   2.899336   2.195233     1.41   0.160     .6573721    12.78751
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4110474   .1946428     2.11   0.035     .0295546    .7925402
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -96.737145
Iteration 2:   log pseudolikelihood =    -95.225
Iteration 3:   log pseudolikelihood =  -95.08453
Iteration 4:   log pseudolikelihood =  -95.08044
Iteration 5:   log pseudolikelihood = -95.080434
Refining estimates:
Iteration 0:   log pseudolikelihood = -95.080434

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(3)  =   3.46
Log pseudolikelihood = -95.080434                       Prob > chi2   = 0.3261

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   1.112856   .3286361     0.36   0.717      .623838    1.985209
        educ |   3.121433   2.569015     1.38   0.167     .6220056     15.6644
     fasting |   5.288513   5.955168     1.48   0.139     .5818779     48.0657
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1069299   .2953087     0.36   0.717    -.4718646    .6857243
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -95.554369
Iteration 2:   log pseudolikelihood = -94.142112
Iteration 3:   log pseudolikelihood = -94.017648
Iteration 4:   log pseudolikelihood = -94.014381
Iteration 5:   log pseudolikelihood = -94.014377
Refining estimates:
Iteration 0:   log pseudolikelihood = -94.014377

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(4)  =  10.63
Log pseudolikelihood = -94.014377                       Prob > chi2   = 0.0311

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |    1.46651   .3251752     1.73   0.084     .9496085    2.264776
     z_crp_l |   1.014504   .3296686     0.04   0.965     .5366004    1.918034
        educ |   3.205923   2.640035     1.41   0.157     .6382633    16.10298
     fasting |   4.311891   5.235338     1.20   0.229     .3991817     46.5763
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3828853   .2217341     1.73   0.084    -.0517055    .8174761
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0143996   .3249556     0.04   0.965    -.6225016    .6513008
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,524
                                                F(4, 1935)        =       3.11
                                                Prob > F          =     0.0146
                                                R-squared         =     0.0058
                                                Root MSE          =     .95806

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0230111   .0204721    -1.12   0.261    -.0631609    .0171387
        educ |   .0330633   .0475208     0.70   0.487    -.0601339    .1262606
     fasting |   .1017481   .1213305     0.84   0.402    -.1362042    .3397004
   1.study_n |  -.2513253    .106529    -2.36   0.018     -.460249   -.0424016
       _cons |  -.0006274   .1094956    -0.01   0.995    -.2153691    .2141142
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0230111   .0204721    -1.12   0.261    -.0631609    .0171387
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -195.10351
Iteration 2:   log pseudolikelihood = -195.10002
Iteration 3:   log pseudolikelihood = -195.10002
Refining estimates:
Iteration 0:   log pseudolikelihood = -195.10002

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(2)  =   6.01
Log pseudolikelihood = -195.10002                       Prob > chi2   = 0.0496

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.501155   .2534829     2.41   0.016     1.078184    2.090058
        educ |   1.183922   .3663449     0.55   0.585     .6455543    2.171266
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4062349   .1688586     2.41   0.016     .0752782    .7371916
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -195.47486
Iteration 2:   log pseudolikelihood = -195.47421
Refining estimates:
Iteration 0:   log pseudolikelihood = -195.47421

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(3)  =   3.33
Log pseudolikelihood = -195.47421                       Prob > chi2   = 0.3434

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   1.377374   .2671659     1.65   0.099     .9417735    2.014454
        educ |   1.070418   .3110397     0.23   0.815     .6056383    1.891881
     fasting |   .5988238   .3028465    -1.01   0.311      .222237    1.613548
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3201789   .1939675     1.65   0.099    -.0599904    .7003483
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -192.47485
Iteration 2:   log pseudolikelihood = -192.45491
Iteration 3:   log pseudolikelihood = -192.45491
Refining estimates:
Iteration 0:   log pseudolikelihood = -192.45491

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(4)  =   9.60
Log pseudolikelihood = -192.45491                       Prob > chi2   = 0.0477

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.564725   .2592712     2.70   0.007     1.130827    2.165111
        z_tc |   1.397965   .2694051     1.74   0.082     .9582067    2.039545
        educ |   1.155501   .3450562     0.48   0.628     .6435527    2.074706
     fasting |   .5244704   .2617153    -1.29   0.196     .1972259    1.394691
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4477103   .1656976     2.70   0.007     .1229491    .7724716
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3350174   .1927123     1.74   0.082    -.0426918    .7127267
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,512
                                                F(4, 1928)        =      34.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0612
                                                Root MSE          =     .78548

                             (Std. err. adjusted for 1,929 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.1947078   .0175274   -11.11   0.000    -.2290825   -.1603332
        educ |   .0413688   .0393303     1.05   0.293    -.0357656    .1185032
     fasting |    .012941   .1007828     0.13   0.898    -.1847138    .2105958
   1.study_n |  -.3041242   .0976819    -3.11   0.002    -.4956975   -.1125508
       _cons |  -.1850798   .1006462    -1.84   0.066    -.3824667    .0123071
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1947078   .0175274   -11.11   0.000    -.2290825   -.1603332
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -188.30312
Iteration 1:   log pseudolikelihood = -186.48503
Iteration 2:   log pseudolikelihood = -186.48307
Iteration 3:   log pseudolikelihood = -186.48307
Refining estimates:
Iteration 0:   log pseudolikelihood = -186.48307

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =     2,512                             Number of obs =  2,512
No. of failures =        37
Time at risk    = 23,546.24
                                                        Wald chi2(2)  =   4.68
Log pseudolikelihood = -186.48307                       Prob > chi2   = 0.0965

                             (Std. err. adjusted for 1,929 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.425477   .2390212     2.11   0.034       1.0262    1.980104
        educ |   1.125463   .3508501     0.38   0.705     .6109122    2.073401
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3545062   .1676781     2.11   0.034     .0258631    .6831493
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -188.30312
Iteration 1:   log pseudolikelihood = -186.58717
Iteration 2:   log pseudolikelihood =  -186.5766
Iteration 3:   log pseudolikelihood =  -186.5766
Refining estimates:
Iteration 0:   log pseudolikelihood =  -186.5766

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =     2,512                             Number of obs =  2,512
No. of failures =        37
Time at risk    = 23,546.24
                                                        Wald chi2(3)  =   3.69
Log pseudolikelihood = -186.5766                        Prob > chi2   = 0.2972

                             (Std. err. adjusted for 1,929 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   1.290975   .2116942     1.56   0.119     .9361334     1.78032
        educ |   .9706184   .2955015    -0.10   0.922     .5344451    1.762763
     fasting |   .5700697   .2907031    -1.10   0.270      .209828    1.548789
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2553978   .1639801     1.56   0.119    -.0659973    .5767929
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -188.30312
Iteration 1:   log pseudolikelihood = -183.58127
Iteration 2:   log pseudolikelihood = -183.52736
Iteration 3:   log pseudolikelihood = -183.52734
Refining estimates:
Iteration 0:   log pseudolikelihood = -183.52734

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =     2,512                             Number of obs =  2,512
No. of failures =        37
Time at risk    = 23,546.24
                                                        Wald chi2(4)  =  11.33
Log pseudolikelihood = -183.52734                       Prob > chi2   = 0.0231

                             (Std. err. adjusted for 1,929 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.603266   .2763944     2.74   0.006     1.143571     2.24775
       z_hdl |   1.428562   .2335048     2.18   0.029     1.036971    1.968031
        educ |   1.057409   .3262973     0.18   0.856     .5775342    1.936014
     fasting |   .4993153   .2446799    -1.42   0.156     .1910996    1.304638
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4720428   .1723946     2.74   0.006     .1341556    .8099299
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3566687   .1634544     2.18   0.029      .036304    .6770334
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,366
                                                F(4, 1850)        =       2.25
                                                Prob > F          =     0.0612
                                                R-squared         =     0.0038
                                                Root MSE          =     .98399

                             (Std. err. adjusted for 1,851 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.0415448   .0215901    -1.92   0.054    -.0838882    .0007986
        educ |   .0523626   .0515299     1.02   0.310    -.0487003    .1534254
     fasting |   .0268909   .1845929     0.15   0.884    -.3351414    .3889232
   1.study_n |   .3428943   .2288062     1.50   0.134    -.1058512    .7916398
       _cons |  -.4520972    .233408    -1.94   0.053    -.9098679    .0056735
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0415448   .0215901    -1.92   0.054    -.0838882    .0007986
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.28237
Iteration 1:   log pseudolikelihood = -101.90697
Iteration 2:   log pseudolikelihood = -101.84486
Iteration 3:   log pseudolikelihood = -101.84448
Iteration 4:   log pseudolikelihood = -101.84448
Refining estimates:
Iteration 0:   log pseudolikelihood = -101.84448

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,366                           Number of obs =  2,366
No. of failures =          16
Time at risk    = 21,319.2649
                                                        Wald chi2(2)  =   6.91
Log pseudolikelihood = -101.84448                       Prob > chi2   = 0.0316

                             (Std. err. adjusted for 1,851 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.449794   .2842564     1.89   0.058     .9872198    2.129112
        educ |   3.052259   2.290391     1.49   0.137      .701272    13.28484
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3714213   .1960668     1.89   0.058    -.0128625    .7557051
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.28237
Iteration 1:   log pseudolikelihood = -103.93458
Iteration 2:   log pseudolikelihood = -102.25758
Iteration 3:   log pseudolikelihood = -102.08713
Iteration 4:   log pseudolikelihood = -102.08123
Iteration 5:   log pseudolikelihood = -102.08121
Refining estimates:
Iteration 0:   log pseudolikelihood = -102.08121

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,366                           Number of obs =  2,366
No. of failures =          16
Time at risk    = 21,319.2649
                                                        Wald chi2(3)  =   4.20
Log pseudolikelihood = -102.08121                       Prob > chi2   = 0.2411

                             (Std. err. adjusted for 1,851 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.099847   .3519229     0.30   0.766     .5874478    2.059183
        educ |   3.179747   2.620441     1.40   0.160     .6322874    15.99082
     fasting |    5.99076    6.57237     1.63   0.103      .697657    51.44248
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0951707   .3199745     0.30   0.766    -.5319679    .7223092
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.28237
Iteration 1:   log pseudolikelihood = -102.79178
Iteration 2:   log pseudolikelihood = -101.23672
Iteration 3:   log pseudolikelihood = -101.08493
Iteration 4:   log pseudolikelihood = -101.08015
Iteration 5:   log pseudolikelihood = -101.08014
Refining estimates:
Iteration 0:   log pseudolikelihood = -101.08014

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,366                           Number of obs =  2,366
No. of failures =          16
Time at risk    = 21,319.2649
                                                        Wald chi2(4)  =  10.06
Log pseudolikelihood = -101.08014                       Prob > chi2   = 0.0394

                             (Std. err. adjusted for 1,851 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.417328   .3094095     1.60   0.110     .9239508    2.174161
       z_ldl |   1.120435   .3601885     0.35   0.724     .5966903    2.103895
        educ |   3.292428   2.710159     1.45   0.148     .6559198    16.52654
     fasting |   4.882957   5.743327     1.35   0.178     .4869685    48.96265
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3487732   .2183049     1.60   0.110    -.0790965    .7766429
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1137167   .3214721     0.35   0.724     -.516357    .7437905
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,524
                                                F(4, 1935)        =      55.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0863
                                                Root MSE          =     .99771

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2980152   .0206951    14.40   0.000     .2574282    .3386023
        educ |  -.0339446   .0483024    -0.70   0.482    -.1286747    .0607856
     fasting |   .1245069   .1456909     0.85   0.393    -.1612207    .4102344
   1.study_n |  -.0892998   .1144669    -0.78   0.435    -.3137912    .1351917
       _cons |   .2652999    .116594     2.28   0.023     .0366368     .493963
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2980152   .0206951    14.40   0.000     .2574282    .3386023
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -195.10351
Iteration 2:   log pseudolikelihood = -195.10002
Iteration 3:   log pseudolikelihood = -195.10002
Refining estimates:
Iteration 0:   log pseudolikelihood = -195.10002

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(2)  =   6.01
Log pseudolikelihood = -195.10002                       Prob > chi2   = 0.0496

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.501155   .2534829     2.41   0.016     1.078184    2.090058
        educ |   1.183922   .3663449     0.55   0.585     .6455543    2.171266
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4062349   .1688586     2.41   0.016     .0752782    .7371916
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -196.92274
Iteration 2:   log pseudolikelihood = -196.92238
Refining estimates:
Iteration 0:   log pseudolikelihood = -196.92238

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(3)  =   1.21
Log pseudolikelihood = -196.92238                       Prob > chi2   = 0.7516

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |   1.078849   .1562952     0.52   0.600     .8121668    1.433098
        educ |   1.038202   .3042274     0.13   0.898     .5845906    1.843792
     fasting |   .6393944   .3137881    -0.91   0.362     .2443625    1.673027
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0758946   .1448722     0.52   0.600    -.2080496    .3598388
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -197.61492
Iteration 1:   log pseudolikelihood = -194.16993
Iteration 2:   log pseudolikelihood = -194.16209
Iteration 3:   log pseudolikelihood = -194.16209
Refining estimates:
Iteration 0:   log pseudolikelihood = -194.16209

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,524                           Number of obs =  2,524
No. of failures =          39
Time at risk    = 23,732.8824
                                                        Wald chi2(4)  =   7.60
Log pseudolikelihood = -194.16209                       Prob > chi2   = 0.1074

                             (Std. err. adjusted for 1,936 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.564015   .2785176     2.51   0.012     1.103215    2.217286
      z_tg_l |   .9800972   .1548048    -0.13   0.899     .7191562    1.335719
        educ |   1.117992   .3396167     0.37   0.713     .6164051    2.027736
     fasting |   .5516376   .2720128    -1.21   0.228     .2098582    1.450046
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4472563   .1780786     2.51   0.012     .0982286    .7962839
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0201035   .1579484    -0.13   0.899    -.3296767    .2894697
------------------------------------------------------------------------------

. 
. /// Adding CRP without fasting adjustment..
> regress z_crp_l z_bmi educ i.study_n if(sex==1), vce(cluster pairid)

Linear regression                               Number of obs     =      2,378
                                                F(3, 1857)        =      85.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0924
                                                Root MSE          =     .95405

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .3257541   .0215192    15.14   0.000     .2835498    .3679584
        educ |  -.0468032   .0467518    -1.00   0.317    -.1384949    .0448885
   1.study_n |  -.5507329    .153795    -3.58   0.000    -.8523623   -.2491036
       _cons |    .508587   .1551344     3.28   0.001     .2043309     .812843
------------------------------------------------------------------------------

. regress z_crp_l z_whr educ i.study_n if(sex==1), vce(cluster pairid)

Linear regression                               Number of obs     =      2,324
                                                F(3, 1825)        =      65.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0808
                                                Root MSE          =     .95702

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .2742516   .0210547    13.03   0.000     .2329577    .3155455
        educ |  -.0706236   .0481614    -1.47   0.143     -.165081    .0238337
   1.study_n |   -.516609   .1699508    -3.04   0.002    -.8499275   -.1832906
       _cons |   .5532233   .1713319     3.23   0.001     .2171961    .8892504
------------------------------------------------------------------------------

. /*     z_bmi |   .3257541     .2835498    .3679584
>        z_whr |   .2742516     .2329577    .3155455*/
.            
. stcox z_bmi educ if(z_crp_l!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood = -102.80887
Iteration 2:   log pseudolikelihood = -102.74392
Iteration 3:   log pseudolikelihood = -102.74348
Iteration 4:   log pseudolikelihood = -102.74348
Refining estimates:
Iteration 0:   log pseudolikelihood = -102.74348

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(2)  =   4.08
Log pseudolikelihood = -102.74348                       Prob > chi2   = 0.1299

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.238713    .213034     1.24   0.213      .884262    1.735244
        educ |   3.085518    2.31986     1.50   0.134     .7068847    13.46814
------------------------------------------------------------------------------

. stcox z_whr educ if(z_crp_l!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -94.718326
Iteration 2:   log pseudolikelihood = -94.665983
Iteration 3:   log pseudolikelihood = -94.665755
Refining estimates:
Iteration 0:   log pseudolikelihood = -94.665755

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(2)  =   7.51
Log pseudolikelihood = -94.665755                       Prob > chi2   = 0.0234

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.508397   .2935985     2.11   0.035     1.029996    2.209001
        educ |   2.899336   2.195233     1.41   0.160     .6573721    12.78751
------------------------------------------------------------------------------

. /*     z_bmi |   1.238713      .884262    1.735244
>        z_whr |   1.508397     1.029996    2.209001*/
.            
. stcox z_crp_l educ if(z_bmi!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood = -103.11163
Iteration 2:   log pseudolikelihood = -103.05005
Iteration 3:   log pseudolikelihood = -103.04963
Iteration 4:   log pseudolikelihood = -103.04963
Refining estimates:
Iteration 0:   log pseudolikelihood = -103.04963

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(2)  =   2.23
Log pseudolikelihood = -103.04963                       Prob > chi2   = 0.3273

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   1.035075   .2945357     0.12   0.904     .5925954    1.807946
        educ |   2.995856   2.238516     1.47   0.142     .6926272    12.95813
------------------------------------------------------------------------------

. stcox z_crp_l educ if(z_whr!=. & sex==1), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -95.941055
Iteration 2:   log pseudolikelihood = -95.895008
Iteration 3:   log pseudolikelihood = -95.894773
Refining estimates:
Iteration 0:   log pseudolikelihood = -95.894773

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(2)  =   2.17
Log pseudolikelihood = -95.894773                       Prob > chi2   = 0.3379

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   1.123358   .3188161     0.41   0.682     .6440828    1.959271
        educ |   2.826632   2.139042     1.37   0.170     .6413958    12.45697
------------------------------------------------------------------------------

. /*      z_crp_l |   1.035075     .5925954    1.807946
>         z_crp_l |   1.123358     .6440828    1.959271*/
. 
. stcox z_bmi z_crp_l educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -104.39059
Iteration 1:   log pseudolikelihood = -102.80076
Iteration 2:   log pseudolikelihood = -102.73569
Iteration 3:   log pseudolikelihood = -102.73524
Iteration 4:   log pseudolikelihood = -102.73524
Refining estimates:
Iteration 0:   log pseudolikelihood = -102.73524

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,378                           Number of obs =  2,378
No. of failures =          16
Time at risk    = 21,444.4956
                                                        Wald chi2(3)  =   4.25
Log pseudolikelihood = -102.73524                       Prob > chi2   = 0.2354

                             (Std. err. adjusted for 1,858 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.254233   .2893064     0.98   0.326      .798062     1.97115
     z_crp_l |   .9670577   .3259062    -0.10   0.921     .4995634    1.872036
        educ |   3.074121   2.294355     1.50   0.132     .7119195    13.27428
------------------------------------------------------------------------------

. stcox z_whr z_crp_l educ if(sex==1), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -97.122312
Iteration 1:   log pseudolikelihood = -94.716292
Iteration 2:   log pseudolikelihood = -94.664186
Iteration 3:   log pseudolikelihood = -94.663958
Refining estimates:
Iteration 0:   log pseudolikelihood = -94.663958

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,324                           Number of obs =  2,324
No. of failures =          15
Time at risk    = 20,968.4956
                                                        Wald chi2(3)  =   7.56
Log pseudolikelihood = -94.663958                       Prob > chi2   = 0.0561

                             (Std. err. adjusted for 1,826 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.503372    .308645     1.99   0.047      1.00534    2.248121
     z_crp_l |   1.015949   .3207995     0.05   0.960     .5471336    1.886471
        educ |   2.904554   2.186885     1.42   0.157     .6640431    12.70465
------------------------------------------------------------------------------

. /*     z_bmi |   1.254233      .798062     1.97115
>      z_crp_l |   .9670577     .4995634    1.872036
>        z_whr |   1.503372      1.00534    2.248121
>      z_crp_l |   1.015949     .5471336    1.886471*/
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    /////  SURVIVAL MODELS, WOMEN /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. // Base model of BMI and WHR, full sample
. stcox z_bmi educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -372.77656
Iteration 1:   log pseudolikelihood = -372.17151
Iteration 2:   log pseudolikelihood = -372.17004
Iteration 3:   log pseudolikelihood = -372.17004
Refining estimates:
Iteration 0:   log pseudolikelihood = -372.17004

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,351                           Number of obs =  3,351
No. of failures =          65
Time at risk    = 33,287.0716
                                                        Wald chi2(2)  =   1.28
Log pseudolikelihood = -372.17004                       Prob > chi2   = 0.5284

                             (Std. err. adjusted for 2,423 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |    1.10091   .1066903     0.99   0.321     .9104606    1.331198
        educ |   1.220337   .3559241     0.68   0.495     .6889982    2.161433
------------------------------------------------------------------------------

. stcox z_whr educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.86716
Iteration 1:   log pseudolikelihood = -302.49025
Iteration 2:   log pseudolikelihood = -302.49011
Refining estimates:
Iteration 0:   log pseudolikelihood = -302.49011

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,259                           Number of obs =  3,259
No. of failures =          53
Time at risk    = 31,418.4163
                                                        Wald chi2(2)  =   0.94
Log pseudolikelihood = -302.49011                       Prob > chi2   = 0.6253

                             (Std. err. adjusted for 2,379 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.131922   .1447541     0.97   0.333      .880972    1.454358
        educ |   1.008719   .3155259     0.03   0.978     .5464064    1.862194
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |    1.10091   .1066903     0.99   0.321     .9104606    1.33119
> 8
>        z_whr |   1.131922   .1447541     0.97   0.333      .880972    1.45435
> 8
> -----------------------------------------------------------------------------
> -*/
. 
. // BMI, adjusted for WHR, and vice versa 
. stcox z_bmi z_whr educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -302.8629
Iteration 1:   log pseudolikelihood = -302.05946
Iteration 2:   log pseudolikelihood = -302.05446
Iteration 3:   log pseudolikelihood = -302.05446
Refining estimates:
Iteration 0:   log pseudolikelihood = -302.05446

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,257                           Number of obs =  3,257
No. of failures =          53
Time at risk    = 31,398.4163
                                                        Wald chi2(3)  =   2.45
Log pseudolikelihood = -302.05446                       Prob > chi2   = 0.4849

                             (Std. err. adjusted for 2,378 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.141172   .1391912     1.08   0.279     .8985212    1.449353
       z_whr |   1.083331   .1525142     0.57   0.570     .8221045    1.427564
        educ |   1.006398   .3138587     0.02   0.984     .5461491    1.854507
------------------------------------------------------------------------------

. /*---------------------------------------------------------------------------
> -
>              |               Robust
>           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval
> ]
> -------------+---------------------------------------------------------------
> -
>        z_bmi |   1.141172   .1391912     1.08   0.279     .8985212    1.44935
> 3
>        z_whr |   1.083331   .1525142     0.57   0.570     .8221045    1.42756
> 4
> -----------------------------------------------------------------------------
> -*/
. 
. // Loop over models for BMI, WHR, and biomarkers
. foreach ad_measure in z_bmi z_whr {
  2. 
.         cap postclose coxreg_dem
  3.                 postfile coxreg_dem str20  (exp_var base_lin base_bmi base
> _biom adj_bmi adj_biom) ///
>                 using P:\Dementia_IK\FORTE_postdoc\Aim_2\Output\BMI_dem_media
> tion_20210824_mid_women_`ad_measure'.dta, replace
  4.         foreach exp_var in z_crp_l z_tc z_hdl z_ldl z_tg_l {
  5.                 set more off
  6.                 
.                 // BMI/WHR on the biomarker
.                 regress `exp_var' `ad_measure' educ fasting i.study_n if(sex=
> =2), vce(cluster pairid)
  7.                 lincom `ad_measure' 
  8.                         local m_lin = r(estimate)
  9.                         local se_lin = r(se)
 10.                         local Lci_lin = `m_lin'-1.96*`se_lin'
 11.                         local Uci_lin = `m_lin'+1.96*`se_lin'
 12.                         local base_lin= string(`m_lin',"%9.2f")+" ("+strin
> g(`Lci_lin',"%9.2f")+"-"+string(`Uci_lin',"%9.2f")+")"  
 13.                         
.                 // Base model
.                 stcox `ad_measure'  educ if(`exp_var'!=. & sex==2), vce(clust
> er pairid) strata(study_main)
 14.                 lincom `ad_measure' 
 15.                         local m_m0 = r(estimate)
 16.                         local se_m0 = r(se)
 17.                         local Lci_m0 = exp(`m_m0'-1.96*`se_m0')
 18.                         local Uci_m0 = exp(`m_m0'+1.96*`se_m0')
 19.                         local base_bmi= string(exp(`m_m0'),"%9.2f")+" ("+s
> tring(`Lci_m0',"%9.2f")+"-"+string(`Uci_m0',"%9.2f")+")"  
 20.                         
.                 // Base model, biomarker
.                 stcox `exp_var'  educ fasting  if(`ad_measure'!=. & sex==2), 
> vce(cluster pairid) strata(study_main)
 21.                 lincom `exp_var' 
 22.                         local m_m1 = r(estimate)
 23.                         local se_m1 = r(se)
 24.                         local Lci_m1 = exp(`m_m1'-1.96*`se_m1')
 25.                         local Uci_m1 = exp(`m_m1'+1.96*`se_m1')
 26.                         local base_biom= string(exp(`m_m1'),"%9.2f")+" ("+
> string(`Lci_m1',"%9.2f")+"-"+string(`Uci_m1',"%9.2f")+")"  
 27.                 
.                 // Adjusted for the biomarker
.                 stcox `ad_measure' `exp_var'  educ fasting if(sex==2), vce(cl
> uster pairid) strata(study_main)
 28.                 lincom `ad_measure' 
 29.                         local m_m2 = r(estimate)
 30.                         local se_m2 = r(se)
 31.                         local Lci_m2 = exp(`m_m2'-1.96*`se_m2')
 32.                         local Uci_m2 = exp(`m_m2'+1.96*`se_m2')
 33.                         local adj_bmi= string(exp(`m_m2'),"%9.2f")+" ("+st
> ring(`Lci_m2',"%9.2f")+"-"+string(`Uci_m2',"%9.2f")+")"  
 34.                 lincom `exp_var'
 35.                         local m_m3 = r(estimate)
 36.                         local se_m3 = r(se)
 37.                         local Lci_m3 = exp(`m_m3'-1.96*`se_m3')
 38.                         local Uci_m3 = exp(`m_m3'+1.96*`se_m3')
 39.                         local adj_biom= string(exp(`m_m3'),"%9.2f")+" ("+s
> tring(`Lci_m3',"%9.2f")+"-"+string(`Uci_m3',"%9.2f")+")"  
 40. 
.                 post coxreg_dem ("`exp_var'") ("`base_lin'") ("`base_bmi'") (
> "`base_biom'") ("`adj_bmi'") ("`adj_biom'") 
 41.         }
 42.         postclose coxreg_dem
 43. }         

Linear regression                               Number of obs     =      3,018
                                                F(4, 2247)        =     168.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1879
                                                Root MSE          =     .89948

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .4079573   .0159306    25.61   0.000      .376717    .4391975
        educ |  -.0874115   .0417528    -2.09   0.036    -.1692896   -.0055334
     fasting |  -.0641192   .1700552    -0.38   0.706    -.3976009    .2693625
   1.study_n |   .0008844    .206354     0.00   0.997    -.4037801    .4055489
       _cons |   .1082018    .209302     0.52   0.605    -.3022436    .5186472
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .4079573   .0159306    25.61   0.000      .376717    .4391975
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood = -176.76847
Iteration 2:   log pseudolikelihood = -176.76676
Iteration 3:   log pseudolikelihood = -176.76676
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.76676

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(2)  =   1.33
Log pseudolikelihood = -176.76676                       Prob > chi2   = 0.5151

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.151245   .1413198     1.15   0.251     .9050642    1.464388
        educ |   1.074617    .508605     0.15   0.879     .4249999    2.717181
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1408439   .1227539     1.15   0.251    -.0997494    .3814372
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood = -176.42442
Iteration 2:   log pseudolikelihood = -176.42399
Iteration 3:   log pseudolikelihood = -176.42399
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.42399

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(3)  =   2.00
Log pseudolikelihood = -176.42399                       Prob > chi2   = 0.5720

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .7996319   .1538962    -1.16   0.245     .5483639    1.166034
        educ |   1.021476   .4802137     0.05   0.964     .4065031    2.566805
     fasting |     .57596   .3685149    -0.86   0.389     .1643503    2.018432
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2236038   .1924588    -1.16   0.245    -.6008162    .1536087
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood = -175.52582
Iteration 2:   log pseudolikelihood = -175.52361
Iteration 3:   log pseudolikelihood = -175.52361
Refining estimates:
Iteration 0:   log pseudolikelihood = -175.52361

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(4)  =   6.50
Log pseudolikelihood = -175.52361                       Prob > chi2   = 0.1646

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.320723   .1858011     1.98   0.048     1.002452    1.740043
     z_crp_l |    .705041    .149432    -1.65   0.099     .4653759    1.068132
        educ |     1.0716   .5105784     0.15   0.885     .4211781    2.726461
     fasting |   .5448315   .3412113    -0.97   0.332     .1596543    1.859276
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2781797   .1406813     1.98   0.048     .0024494      .55391
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.3494993    .211948    -1.65   0.099    -.7649097    .0659112
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,346
                                                F(4, 2419)        =      14.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     .98092

                             (Std. err. adjusted for 2,420 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.0341804   .0176651    -1.93   0.053    -.0688206    .0004598
        educ |  -.0930599   .0448362    -2.08   0.038    -.1809812   -.0051386
     fasting |   .0980017   .1295871     0.76   0.450    -.1561116     .352115
   1.study_n |  -.5823243   .1114442    -5.23   0.000    -.8008603   -.3637883
       _cons |   .7591141   .1133053     6.70   0.000     .5369285    .9812996
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0341804   .0176651    -1.93   0.053    -.0688206    .0004598
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -372.3691
Iteration 1:   log pseudolikelihood = -371.72221
Iteration 2:   log pseudolikelihood = -371.72072
Iteration 3:   log pseudolikelihood = -371.72072
Refining estimates:
Iteration 0:   log pseudolikelihood = -371.72072

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,220.0195
                                                        Wald chi2(2)  =   1.33
Log pseudolikelihood = -371.72072                       Prob > chi2   = 0.5143

                             (Std. err. adjusted for 2,420 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.100382   .1064874     0.99   0.323     .9102691      1.3302
        educ |   1.238951   .3629153     0.73   0.464     .6977808    2.199831
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .095657   .0967732     0.99   0.323     -.094015    .2853289
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -372.3691
Iteration 1:   log pseudolikelihood = -370.54428
Iteration 2:   log pseudolikelihood = -370.54192
Refining estimates:
Iteration 0:   log pseudolikelihood = -370.54192

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,220.0195
                                                        Wald chi2(3)  =   2.85
Log pseudolikelihood = -370.54192                       Prob > chi2   = 0.4156

                             (Std. err. adjusted for 2,420 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   1.185307   .1320931     1.53   0.127     .9527333    1.474656
        educ |   1.285419   .3910108     0.83   0.409     .7081387    2.333303
     fasting |   1.282574   .4396298     0.73   0.468     .6551111     2.51102
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1700022   .1114421     1.53   0.127    -.0484203    .3884247
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood =  -372.3691
Iteration 1:   log pseudolikelihood = -370.23394
Iteration 2:   log pseudolikelihood =  -370.2301
Iteration 3:   log pseudolikelihood =  -370.2301
Refining estimates:
Iteration 0:   log pseudolikelihood =  -370.2301

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,220.0195
                                                        Wald chi2(4)  =   3.57
Log pseudolikelihood = -370.2301                        Prob > chi2   = 0.4671

                             (Std. err. adjusted for 2,420 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.097907   .1082978     0.95   0.344     .9049051    1.332074
        z_tc |   1.177954   .1315918     1.47   0.143     .9463216    1.466283
        educ |   1.290323   .3935746     0.84   0.403     .7096838    2.346022
     fasting |    1.31125   .4512878     0.79   0.431     .6679301    2.574188
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0934061   .0986402     0.95   0.344    -.0999252    .2867374
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1637791   .1117122     1.47   0.143    -.0551728    .3827309
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,319
                                                F(4, 2408)        =      82.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0969
                                                Root MSE          =     .94969

                             (Std. err. adjusted for 2,409 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |  -.2904438   .0165555   -17.54   0.000    -.3229084   -.2579793
        educ |   .0927166   .0427037     2.17   0.030     .0089768    .1764565
     fasting |  -.0835939   .1114476    -0.75   0.453     -.302137    .1349492
   1.study_n |  -.1685208   .0991789    -1.70   0.089    -.3630057     .025964
       _cons |   .4016575   .1016956     3.95   0.000     .2022375    .6010775
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2904438   .0165555   -17.54   0.000    -.3229084   -.2579793
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -348.43251
Iteration 1:   log pseudolikelihood = -348.07187
Iteration 2:   log pseudolikelihood = -348.07177
Refining estimates:
Iteration 0:   log pseudolikelihood = -348.07177

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,319                           Number of obs =  3,319
No. of failures =          61
Time at risk    = 32,599.5625
                                                        Wald chi2(2)  =   0.68
Log pseudolikelihood = -348.07177                       Prob > chi2   = 0.7119

                             (Std. err. adjusted for 2,409 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.043193   .0962735     0.46   0.647      .870582    1.250028
        educ |   1.240141   .3758934     0.71   0.478     .6846477    2.246337
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0422865   .0922873     0.46   0.647    -.1385933    .2231662
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -348.43251
Iteration 1:   log pseudolikelihood = -347.80286
Iteration 2:   log pseudolikelihood = -347.80245
Refining estimates:
Iteration 0:   log pseudolikelihood = -347.80245

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,319                           Number of obs =  3,319
No. of failures =          61
Time at risk    = 32,599.5625
                                                        Wald chi2(3)  =   0.94
Log pseudolikelihood = -347.80245                       Prob > chi2   = 0.8165

                             (Std. err. adjusted for 2,409 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   1.060084   .1414016     0.44   0.662     .8162078    1.376827
        educ |   1.256189   .3870796     0.74   0.459     .6867006     2.29796
     fasting |   1.267894   .4526864     0.66   0.506      .629755    2.552668
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0583477   .1333872     0.44   0.662    -.2030864    .3197818
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -348.43251
Iteration 1:   log pseudolikelihood = -347.62793
Iteration 2:   log pseudolikelihood = -347.62742
Refining estimates:
Iteration 0:   log pseudolikelihood = -347.62742

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,319                           Number of obs =  3,319
No. of failures =          61
Time at risk    = 32,599.5625
                                                        Wald chi2(4)  =   1.34
Log pseudolikelihood = -347.62742                       Prob > chi2   = 0.8537

                             (Std. err. adjusted for 2,409 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.080104   .1076025     0.77   0.439     .8885197    1.312999
       z_hdl |   1.086764   .1534123     0.59   0.556     .8240923    1.433159
        educ |   1.260886   .3902863     0.75   0.454     .6873853    2.312869
     fasting |   1.300402   .4658135     0.73   0.463     .6444234    2.624124
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0770577   .0996224     0.77   0.439    -.1181985     .272314
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0832043   .1411644     0.59   0.556    -.1934728    .3598814
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,105
                                                F(4, 2295)        =       1.09
                                                Prob > F          =     0.3584
                                                R-squared         =     0.0018
                                                Root MSE          =      1.008

                             (Std. err. adjusted for 2,296 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .0033771   .0187782     0.18   0.857     -.033447    .0402012
        educ |  -.0655366   .0468629    -1.40   0.162    -.1574348    .0263615
     fasting |   .0955668   .1741766     0.55   0.583    -.2459932    .4371268
   1.study_n |   .3983259   .2672901     1.49   0.136    -.1258295    .9224812
       _cons |  -.2806084   .2702877    -1.04   0.299    -.8106422    .2494254
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0033771   .0187782     0.18   0.857     -.033447    .0402012
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -184.98014
Iteration 1:   log pseudolikelihood = -184.65959
Iteration 2:   log pseudolikelihood =  -184.6577
Iteration 3:   log pseudolikelihood =  -184.6577
Refining estimates:
Iteration 0:   log pseudolikelihood =  -184.6577

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,105                           Number of obs =  3,105
No. of failures =          26
Time at risk    = 28,081.7447
                                                        Wald chi2(2)  =   1.57
Log pseudolikelihood = -184.6577                        Prob > chi2   = 0.4561

                             (Std. err. adjusted for 2,296 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.145635   .1390954     1.12   0.263     .9030234    1.453428
        educ |   .9050338   .4057468    -0.22   0.824     .3758826    2.179101
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .135959   .1214133     1.12   0.263    -.1020068    .3739247
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -184.98014
Iteration 1:   log pseudolikelihood = -184.70559
Iteration 2:   log pseudolikelihood = -184.70486
Iteration 3:   log pseudolikelihood = -184.70486
Refining estimates:
Iteration 0:   log pseudolikelihood = -184.70486

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,105                           Number of obs =  3,105
No. of failures =          26
Time at risk    = 28,081.7447
                                                        Wald chi2(3)  =   1.15
Log pseudolikelihood = -184.70486                       Prob > chi2   = 0.7650

                             (Std. err. adjusted for 2,296 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |    1.12798   .2312526     0.59   0.557      .754732    1.685817
        educ |   .8866135   .3926816    -0.27   0.786     .3721661    2.112185
     fasting |   .5584296    .370121    -0.88   0.379     .1523356    2.047083
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1204289   .2050147     0.59   0.557    -.2813926    .5222503
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -184.98014
Iteration 1:   log pseudolikelihood =  -184.4133
Iteration 2:   log pseudolikelihood = -184.41109
Iteration 3:   log pseudolikelihood = -184.41109
Refining estimates:
Iteration 0:   log pseudolikelihood = -184.41109

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,105                           Number of obs =  3,105
No. of failures =          26
Time at risk    = 28,081.7447
                                                        Wald chi2(4)  =   3.78
Log pseudolikelihood = -184.41109                       Prob > chi2   = 0.4361

                             (Std. err. adjusted for 2,296 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.149678   .1411761     1.14   0.256     .9037579    1.462516
       z_ldl |   1.130094   .2295706     0.60   0.547     .7589249     1.68279
        educ |   .9118343   .4095679    -0.21   0.837     .3780789    2.199123
     fasting |    .539651   .3492725    -0.95   0.341     .1517745    1.918788
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1394822   .1227961     1.14   0.256    -.1011938    .3801582
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1223004    .203143     0.60   0.547    -.2758524    .5204533
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,346
                                                F(4, 2418)        =      99.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1185
                                                Root MSE          =     .88937

                             (Std. err. adjusted for 2,419 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .2885058   .0154998    18.61   0.000     .2581116       .3189
        educ |  -.1750045   .0398757    -4.39   0.000    -.2531987   -.0968104
     fasting |   .2375457   .1055924     2.25   0.025     .0304849    .4446066
   1.study_n |  -.0546083   .0913661    -0.60   0.550    -.2337722    .1245556
       _cons |   .0773037   .0914692     0.85   0.398    -.1020625    .2566698
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2885058   .0154998    18.61   0.000     .2581116       .3189
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -372.74103
Iteration 1:   log pseudolikelihood =  -372.1296
Iteration 2:   log pseudolikelihood = -372.12809
Iteration 3:   log pseudolikelihood = -372.12809
Refining estimates:
Iteration 0:   log pseudolikelihood = -372.12809

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,240.0716
                                                        Wald chi2(2)  =   1.29
Log pseudolikelihood = -372.12809                       Prob > chi2   = 0.5248

                             (Std. err. adjusted for 2,419 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.101727   .1068952     1.00   0.318     .9109321    1.332484
        educ |   1.221131   .3560845     0.69   0.493     .6895252    2.162592
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0968788   .0970251     1.00   0.318    -.0932869    .2870445
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -372.74103
Iteration 1:   log pseudolikelihood = -372.07044
Iteration 2:   log pseudolikelihood = -372.07001
Refining estimates:
Iteration 0:   log pseudolikelihood = -372.07001

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,240.0716
                                                        Wald chi2(3)  =   1.06
Log pseudolikelihood = -372.07001                       Prob > chi2   = 0.7875

                             (Std. err. adjusted for 2,419 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |    1.02379   .1422759     0.17   0.866      .779686    1.344319
        educ |   1.237866   .3656638     0.72   0.470     .6937927    2.208601
     fasting |   1.334321   .4546549     0.85   0.397     .6842627    2.601942
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0235118   .1389698     0.17   0.866     -.248864    .2958876
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -372.74103
Iteration 1:   log pseudolikelihood = -371.67072
Iteration 2:   log pseudolikelihood = -371.66783
Iteration 3:   log pseudolikelihood = -371.66783
Refining estimates:
Iteration 0:   log pseudolikelihood = -371.66783

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,346                           Number of obs =  3,346
No. of failures =          65
Time at risk    = 33,240.0716
                                                        Wald chi2(4)  =   1.99
Log pseudolikelihood = -371.66783                       Prob > chi2   = 0.7370

                             (Std. err. adjusted for 2,419 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.118108   .1226734     1.02   0.309     .9017663    1.386352
      z_tg_l |   .9823695   .1499549    -0.12   0.907     .7283536    1.324975
        educ |   1.233191   .3628485     0.71   0.476     .6927505     2.19525
     fasting |   1.381642   .4755697     0.94   0.348     .7037309    2.712591
------------------------------------------------------------------------------

 ( 1)  z_bmi = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .111638   .1097152     1.02   0.309    -.1033999    .3266758
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0177877   .1526462    -0.12   0.907    -.3169687    .2813932
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      2,987
                                                F(4, 2229)        =      80.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1045
                                                Root MSE          =     .94562

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .3171284   .0182042    17.42   0.000     .2814296    .3528273
        educ |  -.1062612   .0433876    -2.45   0.014    -.1913455   -.0211768
     fasting |   .0270192   .1843939     0.15   0.884    -.3345825    .3886209
   1.study_n |   .0482566   .2174334     0.22   0.824    -.3781364    .4746497
       _cons |    .047828    .220638     0.22   0.828    -.3848495    .4805056
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
     z_crp_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3171284   .0182042    17.42   0.000     .2814296    .3528273
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood = -169.14434
Iteration 2:   log pseudolikelihood = -169.14419
Refining estimates:
Iteration 0:   log pseudolikelihood = -169.14419

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(2)  =   0.60
Log pseudolikelihood = -169.14419                       Prob > chi2   = 0.7390

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.152808   .2117912     0.77   0.439     .8042227    1.652486
        educ |   1.014539   .4745509     0.03   0.975     .4056194    2.537573
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1422009   .1837176     0.77   0.439     -.217879    .5022808
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood = -168.94351
Iteration 2:   log pseudolikelihood = -168.94329
Iteration 3:   log pseudolikelihood = -168.94329
Refining estimates:
Iteration 0:   log pseudolikelihood = -168.94329

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(3)  =   1.44
Log pseudolikelihood = -168.94329                       Prob > chi2   = 0.6959

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .8287224   .1627998    -0.96   0.339     .5638886    1.217937
        educ |   .9675479   .4588226    -0.07   0.945     .3819642    2.450881
     fasting |   .6106958   .3906696    -0.77   0.441     .1743014    2.139681
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    -.18787   .1964468    -0.96   0.339    -.5728986    .1971586
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood =  -168.4525
Iteration 2:   log pseudolikelihood = -168.45213
Iteration 3:   log pseudolikelihood = -168.45213
Refining estimates:
Iteration 0:   log pseudolikelihood = -168.45213

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(4)  =   2.76
Log pseudolikelihood = -168.45213                       Prob > chi2   = 0.5992

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.241589   .2361969     1.14   0.255     .8551598    1.802637
     z_crp_l |   .7758369   .1621931    -1.21   0.225     .5150174    1.168743
        educ |   .9996691   .4707909    -0.00   0.999     .3971785    2.516094
     fasting |   .6394368   .4108466    -0.70   0.486     .1815053    2.252713
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .2163919   .1902376     1.14   0.255     -.156467    .5892508
------------------------------------------------------------------------------

 ( 1)  z_crp_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   -.253813   .2090557    -1.21   0.225    -.6635546    .1559286
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,254
                                                F(4, 2375)        =       9.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0248
                                                Root MSE          =      .9747

                             (Std. err. adjusted for 2,376 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
        z_tc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .0112035   .0176106     0.64   0.525    -.0233302    .0457372
        educ |  -.0939396    .045091    -2.08   0.037    -.1823614   -.0055177
     fasting |   .1685414   .1409357     1.20   0.232    -.1078283    .4449111
   1.study_n |  -.4975342   .1156989    -4.30   0.000    -.7244155   -.2706528
       _cons |   .6762277   .1178637     5.74   0.000     .4451013     .907354
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
        z_tc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0112035   .0176106     0.64   0.525    -.0233302    .0457372
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.44512
Iteration 1:   log pseudolikelihood = -302.13875
Iteration 2:   log pseudolikelihood = -302.13864
Refining estimates:
Iteration 0:   log pseudolikelihood = -302.13864

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,351.3642
                                                        Wald chi2(2)  =   0.76
Log pseudolikelihood = -302.13864                       Prob > chi2   = 0.6836

                             (Std. err. adjusted for 2,376 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.119645   .1456943     0.87   0.385     .8675959    1.444919
        educ |   1.022976   .3215026     0.07   0.942     .5525202    1.894011
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1130119   .1301254     0.87   0.385    -.1420292    .3680529
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.44512
Iteration 1:   log pseudolikelihood =  -300.4847
Iteration 2:   log pseudolikelihood = -300.47213
Iteration 3:   log pseudolikelihood = -300.47213
Refining estimates:
Iteration 0:   log pseudolikelihood = -300.47213

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,351.3642
                                                        Wald chi2(3)  =   3.86
Log pseudolikelihood = -300.47213                       Prob > chi2   = 0.2771

                             (Std. err. adjusted for 2,376 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        z_tc |   1.154401   .1466806     1.13   0.258     .8999149    1.480854
        educ |   1.077017   .3631532     0.22   0.826     .5561739    2.085616
     fasting |   1.879671    .779276     1.52   0.128     .8340457    4.236175
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .143582   .1270621     1.13   0.258    -.1054551     .392619
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.44512
Iteration 1:   log pseudolikelihood = -300.35974
Iteration 2:   log pseudolikelihood =  -300.3468
Iteration 3:   log pseudolikelihood =  -300.3468
Refining estimates:
Iteration 0:   log pseudolikelihood =  -300.3468

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,351.3642
                                                        Wald chi2(4)  =   5.04
Log pseudolikelihood = -300.3468                        Prob > chi2   = 0.2828

                             (Std. err. adjusted for 2,376 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.076244   .1515837     0.52   0.602      .816626    1.418399
        z_tc |   1.150873   .1471273     1.10   0.272     .8957978     1.47858
        educ |    1.09138   .3666144     0.26   0.795     .5649914    2.108192
     fasting |    1.82463   .7843234     1.40   0.162     .7857477     4.23708
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0734773   .1408451     0.52   0.602    -.2025741    .3495286
------------------------------------------------------------------------------

 ( 1)  z_tc = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1405208   .1278397     1.10   0.272    -.1100405     .391082
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,229
                                                F(4, 2364)        =      65.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0977
                                                Root MSE          =     .95029

                             (Std. err. adjusted for 2,365 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_hdl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |  -.3073262   .0193489   -15.88   0.000    -.3452686   -.2693837
        educ |   .0892729   .0439652     2.03   0.042     .0030585    .1754874
     fasting |    .106262   .1249903     0.85   0.395      -.13884     .351364
   1.study_n |  -.2035753   .1031967    -1.97   0.049    -.4059408   -.0012098
       _cons |   .4578986   .1073094     4.27   0.000     .2474683    .6683288
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_hdl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.3073262   .0193489   -15.88   0.000    -.3452686   -.2693837
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -284.42045
Iteration 1:   log pseudolikelihood = -284.29908
Iteration 2:   log pseudolikelihood = -284.29907
Refining estimates:
Iteration 0:   log pseudolikelihood = -284.29907

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,229                           Number of obs =  3,229
No. of failures =          50
Time at risk    = 30,786.5821
                                                        Wald chi2(2)  =   0.29
Log pseudolikelihood = -284.29907                       Prob > chi2   = 0.8630

                             (Std. err. adjusted for 2,365 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.069985   .1440479     0.50   0.615     .8218332    1.393066
        educ |    1.06409   .3455718     0.19   0.848     .5630456    2.011004
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0676444   .1346261     0.50   0.615    -.1962179    .3315067
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -284.42045
Iteration 1:   log pseudolikelihood = -283.11766
Iteration 2:   log pseudolikelihood = -283.10738
Iteration 3:   log pseudolikelihood = -283.10738
Refining estimates:
Iteration 0:   log pseudolikelihood = -283.10738

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,229                           Number of obs =  3,229
No. of failures =          50
Time at risk    = 30,786.5821
                                                        Wald chi2(3)  =   2.72
Log pseudolikelihood = -283.10738                       Prob > chi2   = 0.4373

                             (Std. err. adjusted for 2,365 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_hdl |   .9335128   .1441132    -0.45   0.656     .6897855    1.263358
        educ |   1.129281   .3761798     0.36   0.715     .5878341     2.16945
     fasting |   2.017855   .8887426     1.59   0.111     .8511136    4.784015
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0688006   .1543773    -0.45   0.656    -.3713746    .2337733
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -284.42045
Iteration 1:   log pseudolikelihood = -283.11623
Iteration 2:   log pseudolikelihood = -283.10589
Iteration 3:   log pseudolikelihood = -283.10589
Refining estimates:
Iteration 0:   log pseudolikelihood = -283.10589

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,229                           Number of obs =  3,229
No. of failures =          50
Time at risk    = 30,786.5821
                                                        Wald chi2(4)  =   3.00
Log pseudolikelihood = -283.10589                       Prob > chi2   = 0.5581

                             (Std. err. adjusted for 2,365 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.008448   .1464201     0.06   0.954     .7586901    1.340425
       z_hdl |   .9356519   .1464593    -0.42   0.671     .6884528    1.271612
        educ |    1.12993   .3759106     0.37   0.713     .5886667    2.168869
     fasting |   2.008615   .9438104     1.48   0.138     .7997111     5.04499
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0084123   .1451936     0.06   0.954    -.2761619    .2929865
------------------------------------------------------------------------------

 ( 1)  z_hdl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.0665118   .1565318    -0.42   0.671    -.3733085     .240285
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,073
                                                F(4, 2279)        =       2.32
                                                Prob > F          =     0.0545
                                                R-squared         =     0.0034
                                                Root MSE          =     1.0048

                             (Std. err. adjusted for 2,280 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
       z_ldl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .0371094   .0186491     1.99   0.047     .0005384    .0736803
        educ |  -.0729817   .0468423    -1.56   0.119    -.1648397    .0188763
     fasting |    .064201   .1790009     0.36   0.720    -.2868207    .4152227
   1.study_n |    .376465    .271238     1.39   0.165    -.1554342    .9083641
       _cons |  -.2528994   .2742876    -0.92   0.357    -.7907789      .28498
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
       z_ldl | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0371094   .0186491     1.99   0.047     .0005384    .0736803
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.26057
Iteration 1:   log pseudolikelihood = -176.79581
Iteration 2:   log pseudolikelihood = -176.79516
Iteration 3:   log pseudolikelihood = -176.79516
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.79516

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,073                           Number of obs =  3,073
No. of failures =          25
Time at risk    = 27,790.7447
                                                        Wald chi2(2)  =   1.12
Log pseudolikelihood = -176.79516                       Prob > chi2   = 0.5718

                             (Std. err. adjusted for 2,280 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.194971   .2076834     1.02   0.305     .8500025    1.679942
        educ |   .8616808   .3800292    -0.34   0.736      .363027    2.045285
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1781216   .1737979     1.02   0.305     -.162516    .5187592
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.26057
Iteration 1:   log pseudolikelihood = -176.83886
Iteration 2:   log pseudolikelihood = -176.83795
Iteration 3:   log pseudolikelihood = -176.83795
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.83795

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,073                           Number of obs =  3,073
No. of failures =          25
Time at risk    = 27,790.7447
                                                        Wald chi2(3)  =   1.42
Log pseudolikelihood = -176.83795                       Prob > chi2   = 0.7018

                             (Std. err. adjusted for 2,280 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_ldl |   1.166042   .2432737     0.74   0.462     .7746873    1.755101
        educ |   .8397738   .3757539    -0.39   0.696     .3493776    2.018504
     fasting |   .5967722   .3962918    -0.78   0.437     .1623906     2.19309
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1536154    .208632     0.74   0.462    -.2552958    .5625265
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.26057
Iteration 1:   log pseudolikelihood = -176.46384
Iteration 2:   log pseudolikelihood = -176.46276
Iteration 3:   log pseudolikelihood = -176.46276
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.46276

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,073                           Number of obs =  3,073
No. of failures =          25
Time at risk    = 27,790.7447
                                                        Wald chi2(4)  =   2.55
Log pseudolikelihood = -176.46276                       Prob > chi2   = 0.6365

                             (Std. err. adjusted for 2,280 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.193553   .2091315     1.01   0.313     .8466347    1.682624
       z_ldl |   1.164262   .2430972     0.73   0.466     .7732506    1.752996
        educ |   .8698784   .3863823    -0.31   0.754      .364227    2.077519
     fasting |   .6192253   .4108248    -0.72   0.470     .1687017    2.272888
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1769343   .1752176     1.01   0.313    -.1664859    .5203545
------------------------------------------------------------------------------

 ( 1)  z_ldl = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1520872   .2087994     0.73   0.466    -.2571521    .5613265
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,254
                                                F(4, 2374)        =     112.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1510
                                                Root MSE          =     .87473

                             (Std. err. adjusted for 2,375 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
      z_tg_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .3507914   .0173664    20.20   0.000     .3167366    .3848462
        educ |  -.1458392   .0399493    -3.65   0.000    -.2241783      -.0675
     fasting |   .1996446   .1154775     1.73   0.084    -.0268027    .4260918
   1.study_n |   .0070211   .0935538     0.08   0.940    -.1764344    .1904767
       _cons |  -.0285615   .0943174    -0.30   0.762    -.2135146    .1563915
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
      z_tg_l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .3507914   .0173664    20.20   0.000     .3167366    .3848462
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.83342
Iteration 1:   log pseudolikelihood = -302.45217
Iteration 2:   log pseudolikelihood = -302.45202
Refining estimates:
Iteration 0:   log pseudolikelihood = -302.45202

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,371.4163
                                                        Wald chi2(2)  =   0.95
Log pseudolikelihood = -302.45202                       Prob > chi2   = 0.6217

                             (Std. err. adjusted for 2,375 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.132764   .1448534     0.97   0.330     .8816392    1.455418
        educ |    1.00967   .3157345     0.03   0.975     .5470159    1.863628
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1246603   .1278761     0.97   0.330    -.1259724    .3752929
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.83342
Iteration 1:   log pseudolikelihood = -301.07931
Iteration 2:   log pseudolikelihood = -301.06707
Iteration 3:   log pseudolikelihood = -301.06707
Refining estimates:
Iteration 0:   log pseudolikelihood = -301.06707

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,371.4163
                                                        Wald chi2(3)  =   3.65
Log pseudolikelihood = -301.06707                       Prob > chi2   = 0.3019

                             (Std. err. adjusted for 2,375 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      z_tg_l |   1.117579   .1611898     0.77   0.441     .8423805    1.482682
        educ |   1.064792   .3508056     0.19   0.849     .5582499    2.030959
     fasting |    1.97819   .8128522     1.66   0.097     .8841041    4.426217
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1111646   .1442312     0.77   0.441    -.1715234    .3938526
------------------------------------------------------------------------------

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -302.83342
Iteration 1:   log pseudolikelihood = -301.00033
Iteration 2:   log pseudolikelihood = -300.98776
Iteration 3:   log pseudolikelihood = -300.98775
Refining estimates:
Iteration 0:   log pseudolikelihood = -300.98775

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,254                           Number of obs =  3,254
No. of failures =          53
Time at risk    = 31,371.4163
                                                        Wald chi2(4)  =   4.50
Log pseudolikelihood = -300.98775                       Prob > chi2   = 0.3429

                             (Std. err. adjusted for 2,375 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |     1.0614   .1489909     0.42   0.671     .8061096    1.397539
      z_tg_l |    1.10062   .1633373     0.65   0.518     .8228393    1.472176
        educ |   1.072928   .3511802     0.22   0.830     .5648893    2.037874
     fasting |   1.934295   .8280647     1.54   0.123     .8358466    4.476298
------------------------------------------------------------------------------

 ( 1)  z_whr = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0595887   .1403721     0.42   0.671    -.2155356     .334713
------------------------------------------------------------------------------

 ( 1)  z_tg_l = 0

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0958737   .1484048     0.65   0.518    -.1949944    .3867417
------------------------------------------------------------------------------

. 
. /// Adding CRP without fasting adjustment..
> regress z_crp_l z_bmi educ i.study_n if(sex==2), vce(cluster pairid)

Linear regression                               Number of obs     =      3,018
                                                F(3, 2247)        =     223.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1879
                                                Root MSE          =     .89935

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   .4078047   .0159467    25.57   0.000     .3765329    .4390765
        educ |  -.0875584   .0417496    -2.10   0.036    -.1694302   -.0056866
   1.study_n |   .0605296   .1399013     0.43   0.665    -.2138197     .334879
       _cons |   .0481248     .14286     0.34   0.736    -.2320267    .3282762
------------------------------------------------------------------------------

. regress z_crp_l z_whr educ i.study_n if(sex==2), vce(cluster pairid)

Linear regression                               Number of obs     =      2,987
                                                F(3, 2229)        =     107.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1045
                                                Root MSE          =     .94546

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
     z_crp_l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   .3171314   .0182006    17.42   0.000     .2814394    .3528234
        educ |  -.1062216   .0433804    -2.45   0.014    -.1912918   -.0211514
   1.study_n |   .0230975   .1384423     0.17   0.868    -.2483919    .2945869
       _cons |   .0731754   .1415297     0.52   0.605    -.2043684    .3507192
------------------------------------------------------------------------------

. /*     z_bmi |   .4078047     .3765329    .4390765
>        z_whr |   .3171314     .2814394    .3528234*/
.            
. stcox z_bmi educ if(z_crp_l!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood = -176.76847
Iteration 2:   log pseudolikelihood = -176.76676
Iteration 3:   log pseudolikelihood = -176.76676
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.76676

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(2)  =   1.33
Log pseudolikelihood = -176.76676                       Prob > chi2   = 0.5151

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.151245   .1413198     1.15   0.251     .9050642    1.464388
        educ |   1.074617    .508605     0.15   0.879     .4249999    2.717181
------------------------------------------------------------------------------

. stcox z_whr educ if(z_crp_l!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood = -169.14434
Iteration 2:   log pseudolikelihood = -169.14419
Refining estimates:
Iteration 0:   log pseudolikelihood = -169.14419

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(2)  =   0.60
Log pseudolikelihood = -169.14419                       Prob > chi2   = 0.7390

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |   1.152808   .2117912     0.77   0.439     .8042227    1.652486
        educ |   1.014539   .4745509     0.03   0.975     .4056194    2.537573
------------------------------------------------------------------------------

. /*     z_bmi |   1.151245     .9050642    1.464388
>        z_whr |   1.152808     .8042227    1.652486*/
.            
. stcox z_crp_l educ if(z_bmi!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood =  -176.4578
Iteration 2:   log pseudolikelihood = -176.45779
Refining estimates:
Iteration 0:   log pseudolikelihood = -176.45779

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(2)  =   1.39
Log pseudolikelihood = -176.45779                       Prob > chi2   = 0.4992

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .7986668   .1536093    -1.17   0.242      .547838    1.164338
        educ |   1.016194   .4769664     0.03   0.973     .4049972    2.549771
------------------------------------------------------------------------------

. stcox z_crp_l educ if(z_whr!=. & sex==2), vce(cluster pairid) strata(study_ma
> in)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood = -168.96903
Iteration 2:   log pseudolikelihood = -168.96903
Refining estimates:
Iteration 0:   log pseudolikelihood = -168.96903

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(2)  =   0.93
Log pseudolikelihood = -168.96903                       Prob > chi2   = 0.6290

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     z_crp_l |   .8278943   .1625476    -0.96   0.336     .5634444    1.216462
        educ |    .963131   .4559906    -0.08   0.937     .3807916    2.436034
------------------------------------------------------------------------------

. /*   z_crp_l |   .7986668      .547838    1.164338
>      z_crp_l |   .8278943     .5634444    1.216462*/
. 
. stcox z_bmi z_crp_l educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -177.06129
Iteration 1:   log pseudolikelihood = -175.56736
Iteration 2:   log pseudolikelihood = -175.56575
Iteration 3:   log pseudolikelihood = -175.56575
Refining estimates:
Iteration 0:   log pseudolikelihood = -175.56575

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       3,018                           Number of obs =  3,018
No. of failures =          25
Time at risk    = 27,304.7447
                                                        Wald chi2(3)  =   4.50
Log pseudolikelihood = -175.56575                       Prob > chi2   = 0.2122

                             (Std. err. adjusted for 2,248 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_bmi |   1.318108   .1848033     1.97   0.049     1.001405    1.734972
     z_crp_l |   .7048029   .1491104    -1.65   0.098     .4655697    1.066966
        educ |    1.06439   .5057905     0.13   0.896     .4193883     2.70138
------------------------------------------------------------------------------

. stcox z_whr z_crp_l educ if(sex==2), vce(cluster pairid) strata(study_main)

         Failure _d: dementia==1
   Analysis time _t: age_exit
  Enter on or after: time age
        ID variable: twinnr

Iteration 0:   log pseudolikelihood = -169.37668
Iteration 1:   log pseudolikelihood = -168.47497
Iteration 2:   log pseudolikelihood = -168.47463
Iteration 3:   log pseudolikelihood = -168.47463
Refining estimates:
Iteration 0:   log pseudolikelihood = -168.47463

Stratified Cox regression with Breslow method for ties
Strata variable: study_main

No. of subjects =       2,987                           Number of obs =  2,987
No. of failures =          24
Time at risk    = 27,022.7447
                                                        Wald chi2(3)  =   2.17
Log pseudolikelihood = -168.47463                       Prob > chi2   = 0.5369

                             (Std. err. adjusted for 2,230 clusters in pairid)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       z_whr |     1.2424   .2360968     1.14   0.253     .8560617    1.803091
     z_crp_l |   .7748874   .1618898    -1.22   0.222     .5145235    1.167003
        educ |   .9956392   .4681672    -0.01   0.993      .396143    2.502373
------------------------------------------------------------------------------

. /*     z_bmi |   1.318108     1.001405    1.734972
>      z_crp_l |   .7048029     .4655697    1.066966
>        z_whr |     1.2424     .8560617    1.803091
>      z_crp_l |   .7748874     .5145235    1.167003
> */
. 
. /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
>                                                                              
>    ///// SAVING THE LOG/OUTPUT /////
> /////////////////////////////////////////////////////////////////////////////
> ///////////////////////////////////
> 
. log close
      name:  <unnamed>
       log:  Z:\Temp\Aim2_GitHub\Individual-level analyses\Output\session.smcl
  log type:  smcl
 closed on:  30 Nov 2021, 16:32:00
-------------------------------------------------------------------------------
